[
{"id": null, "imageURL": "https://doobydobap.com/wp-content/uploads/2021/06/k-elote-15-2.jpg", "name": "K-Elote", "author": "Doobydobap", "difficulty": "Easy", "servingsize": 2, "preptime": "5minutes", "cookingtime": "10minutes", "ingredients": [{"name": "main", "ingredients": ["1 can of corn, drained", "2 tbsp mayo (Japanese mayo preferred but any mayo is fine)", "½ tbsp sugar (optional)", "Pinch of salt ", "Black pepper", "100 g or ½ cup shredded mozzarella cheese (for the stringy pull)", "Cilantro, for garnish", "Cotija cheese", "Tajin or Chili Powder spice (Tajin if you want a little acidity, chili powder if you want a little spice)"]}], "directions": ["Preheat your oven to 450 F / 235C", "In a large bowl, add your drained corn, mayonnaise, and sugar together.", "Season with pinch of kosher salt and freshly ground black pepper.", "Pour the mixture on a skillet or an oven-proof container.", "Sprinkle mozzarella cheese on top", "Bake in the oven for 10 minutes or until the top is nice and golden brown. ", "Garnish with cilantro, cotija cheese, and tajin/chili powder. "]},
{"id": null, "imageURL": "https://doobydobap.com/wp-content/uploads/2021/06/Shime-saba-zushi-3.jpg", "name": "Shime saba zushi", "author": "Doobydobap", "difficulty": "Medium", "servingsize": 2, "preptime": "2hours  30minutes", "cookingtime": "10minutes", "ingredients": [{"name": "main", "ingredients": ["1 cup kosher salt (or enough to cover the fish)", "2 mackerel fillets", "½ cup rice wine vinegar (or enough to submerge the fish)", "½ cup distilled white vinegar (or enough to submerge the fish)", "½ cup kombu dashi stock"]}, {"name": "Sushi rice", "ingredients": ["1 cup short-grain sushi rice (I used rice from Toyama province)", "½ cup water", "½ cup kombu dashi stock"]}, {"name": "Sushi Vinegar", "ingredients": ["1 tsp kosher salt", "2 tbsp rice wine vinegar", "1 tbsp sugar"]}], "directions": ["Cover the mackerel fillets with salt in a cool shaded place in your kitchen. This process helps draw out the moisture from the fish and helps the meat firm up. ", "After 1 hour, rinse the fish in cold water. Dab off any excess moisture with a tea towel. ", "Mix the vinegar and dashi stock together. Gently drop the fish fillets into the vinegar mixture. During the warmer months, make sure to put it in the fridge to ensure the mixture is cold. This process essentially “cooks” the fish fillets. You’ll see the meat turn slightly opaque after 1-1.5 hours. ", "Dab off any excess moisture on the fillets. ", "Gently peel off the translucent film on the skin of the mackerel with your hands. ", "Using a pair of tweezers, pull out the bones in the spine of the mackerel. Use your fingers to feel for any abrasiveness. Gently pull out the bones by pulling it in against the direction it’s facing. ", "Clean the rice under cold running water and rub the granules against each other. Repeat the process another 7-8 times or until the water is not opaque. ", "Soak the rice in water for 30 minutes. ", "Drain the rice and add the kombu dashi stock and water into a clay pot.", "Place the kombu on top of the rice. ", "Cover the lid and heat on high. ", "Gently open the lid to peek if the rice is simmering. When it is, close the lid and drop the heat to the lowest setting. ", "Cook the rice for 10 minutes. ", "Once the rice has absorbed most of the moisture, turn the stove off and let it steam with the residual heat for another 10 minutes. ", "Take the rice out in a large bowl and let some of the excess steam evaporate. ", "Pour the sushi vinegar over the rice and gently combine to make sure each granule is evenly coated.", "Optional, but cut the ends of the mackerel to have a rectangular fillet.", "Slice the mackerel at a 45 degree angle from the center on each side to create “flaps”.", "Fill the middle of the mackerel with pickled ginger and wasabi. ", "Form an oblong rice log to fill the mackerel. ", "Using a sushi roll (even better is just cling film!), gently roll the saba zushi and form into your desired shape. ", "Cut the saba zushi into 2cm / 1 inch thickness. ", "Enjoy 🙂"]},
{"id": null, "imageURL": "https://doobydobap.com/wp-content/uploads/2021/06/IMG_7232.jpg", "name": "Jjajangmyun", "author": "Doobydobap", "difficulty": "Easy", "servingsize": 2, "preptime": "10minutes", "cookingtime": "15minutes", "ingredients": [{"name": "main", "ingredients": ["2 instant ramen noodle packet", "3 tbsp black bean paste", "3 tbsp neutral oil", "1 tbsp soy sauce", "½ cabbage (around ¾ cup), large chops", "1 onion, large chops", "3 scallions, finely diced", "½ cup protein of choice (I used minced beef)", "250 mL water", "1 tbsp potato starch", "2 tbsp cold water", "2 tbsp sugar", "1 egg"]}], "directions": ["Heat a wok/ skillet on high heat.", "Once the wok heats up, turn down the heat to a medium-low. ", "Add the black bean paste to the oil. ", "Using a heat-resistant silicone spatula, break apart the bean paste and cook it out— this helps mellow out some of the astringent taste and develop a deep nutty, umami flavor. ", "The bean paste will separate into smaller pieces instead of one big chunk after 3-4 minutes. ", "Turn the heat on high, and add the scallions, and beef into the paste.", "Break the meat into smaller pieces and cook it out until the fat has rendered out and it’s cooked 80%. ", "Drizzle in the soy sauce to the sides of the wok.", "Let the soy sauce char— this helps develop a super smoky aroma. ", "Transfer the mixture into a separate bowl", "Heat on high, in a clean wok/ skillet, drizzle in neutral oil. ", "Put the onions and cabbages in the wok. ", "Cook until the cabbages char slightly and the onions are slightly translucent. Do not overcook the veggies as we want them to still be crunchy!", "Add the bean paste mixture into the pot. Mix to combine. ", "Add the water in. Taste your sauce and add the sugar in!! Adjust the amount of sweetness to your liking. ", "Mix the water with the potato starch to create a slurry. ", "Pour the slurry into the sauce and stir. The sauce will thicken up nicely and turn glossy. ", "Cook the noodles 80% of the way! I like it al dente because it’s a nice slurpy texture. I cook it in boiling water for five minutes.", "Cold shock the noodles in ice water. Rinse off any excess starch on the noodles. This process also helps firm up the noodles.", "Drizzle plenty of oil into a heated saucepan.", "Once the oil comes up to temperature, crack one egg in.", "Baste the egg whites with oil using a spoon.", "Once the sides are crispy golden brown and the whites are bubbling up in a cloud-like texture, take off the heat. Place on top of noodles. Enjoy with sauce!!"]},
{"id": null, "imageURL": "https://doobydobap.com/wp-content/uploads/2021/06/Crab-Croquettes-37.jpg", "name": "Creamy Crab Croquette", "author": "Doobydobap", "difficulty": "Medium", "servingsize": 3, "preptime": "40minutes", "cookingtime": "10minutes", "ingredients": [{"name": "main", "ingredients": ["150 g crab meat/imitation crab meat (Surimi), shredded", "½ onion, diced", "2 spring onions, finely chopped", "1 tsp salt or to taste", "½ tsp black pepper or to taste", "1 tbsp butter for sautéeing", "½ cup AP flour for dusting ", "1 egg ", "½ cup panko bread crumbs", "Neutral oil for frying", "Parsley for garnish"]}, {"name": "Béchamel ", "ingredients": ["2 tbsp butter", "2 tbsp AP Flour", "120 mL whole milk"]}], "directions": ["Prepare the ingredients. ", "On medium-high heat, melt butter. Once the butter is bubbling, add the crab meat, onion, and spring onions. Sautee for 3 minutes or until the onion has turned slightly translucent.", "Put the mixture in a separate bowl to cool down.", "Using the same pan, let’s make the bechamel sauce. ", "On medium-low heat, melt the butter. Once the butter has melted, add the flour in. Whisk to “cookout” the raw flour taste. ", "After 1 minute, add the milk in. Whisk to combine until it forms a sauce. ", "Add the bechamel to the sauteed ingredients. ", "Transfer to a separate container. Spread out the mixture evenly. ", "Place cling film on top of the mixture. Make sure it adheres to the surface of the mixture. ", "Let it cool in the fridge for at least 1 hour (or in the freezer for 30 mins). This makes the mixture a lot easier to handle. ", "Let’s prepare to fry. Add oil to a large pot. Heat on medium-high until it comes up to 170C / 335F.", "On 3 plates/ baking sheets add flour, mixed egg, and panko bread crumbs. ", "Take the mixture out of the fridge and divide it into 6 equal pieces. ", "Scoop the mixture out and form a ball. Coat the mixture with flour, egg, and panko. Make sure to dust off any excess flour, egg, and pack in the panko tightly. ", "Gently place the croquettes in the oil. Fry for 2 minutes on each side or until golden brown.", "Place it on a rimmed baking tray to cool down. ", "Repeat for all the balls.", "Garnish with parsley and dig in!! "]},
{"id": null, "imageURL": "https://doobydobap.com/wp-content/uploads/2021/06/Thumbnail-42.jpg", "name": "Tonkotsu Ramen", "author": "Doobydobap", "difficulty": "Difficult", "servingsize": 8, "preptime": "6hours  20minutes", "cookingtime": "12hours  30minutes", "ingredients": [{"name": "main", "ingredients": []}, {"name": "Tonkotsu broth", "ingredients": ["1 kg of pork femurs", "1 kg of pork trotters (I used 3)"]}, {"name": "Tare", "ingredients": ["cup dried anchovies", "kombu", "cup soy sauce", "cup sake", "tbsp salt"]}, {"name": "Noodles & Toppings", "ingredients": ["Menma (bamboo shoots, optional)", "Scallions, chopped finely"]}, {"name": "Alkaline noodles 200g per person", "ingredients": ["Recipe at: "]}, {"name": "Cha-shu", "ingredients": ["Recipe at: "]}, {"name": "6 minute Jammy Egg", "ingredients": ["Recipe at: "]}], "directions": ["Clean the bones. Make sure there is no dirt on the trotters. Oftentimes, there is dirt dislodged between the trotters. So make sure to spread those toes apart to get that gunk out.", "Let the bones sit in cold water for 6 hours. This helps with getting the broth cleaner.", "Fill up your pot with the bones until the water barely submerges above the bones.", "Bring to a boil over high heat", "Once the scum rises to the top, strain the bones.", "Scrub away the scum and coagulated blood on the bones with a brush.", "Scrub the pot clean", "Add fresh water until the bones are fully submerged", "Bring to a boil, then put on medium heat for 12 hours.", "During this time, if the water level gets too low, add more water.", "Once the broth is finished, everything should be almost completely disintegrated.", "Strain the broth and reserve the broth in an airtight container.", "Cool overnight.", "Toast the anchovies on low heat.", "Once the anchovies have toasted, add all the ingredients EXCEPT for bonito flakes", "Once the kombu has softened (5 minutes), turn the heat off and steep the bonito flakes.", "Strain and mix with leftover cha-shu sauce.", "Heat your pork broth. Yes, it should coagulate like pork jello. This is a sign that all that good marrow, fat, gelatin, and collagen successfully emulsified into the broth. Do not be freaked out. Pat yourself on the back.", "Spoon 2 tbsp of tare mixture into your bowl.", "Warm your bowl with hot water. Discard water.", "Once the broth is boiling and piping hot, gently pour it in the bowl to mix with the tare.", "Gently place the noodles on a bed of hot broth. Scoop the noodles with your chopstick and lay it over unto itself away from you. This helps the noodles stay separated and not clumped.", "Garnish with 6 minute egg, charred chashu, menma (bamboo shoots- optional), and finely diced scallions.", "Savor. Every. Bit. Until. You. Hold. Your. Bowl. For. The. Last. Drop. Of. Broth."]},
{"id": null, "imageURL": "https://doobydobap.com/wp-content/uploads/2021/06/Alkaline-Ramen-Thumbnail.jpg", "name": "Alkaline Ramen Noodles", "author": "Doobydobap", "difficulty": "Easy", "servingsize": 4, "preptime": "2hours ", "cookingtime": "5minutes", "ingredients": [{"name": "main", "ingredients": ["200 g filtered water", "500 g bread flour (any type with high protein will work well)", "5 g Sodium Carbonate", "Baking soda", "Foil lined baking tray", "5 g salt"]}], "directions": ["Heat the oven to 120C / 250F.", "Line a small baking tray with tin foil.", "Pour 100g of baking soda. (You can use less too, but having this around will actually be pretty useful. Plus, it keeps well in an airtight container)", "Bake for 1hr. The baking soda should have turned into sodium carbonate and become a third of its original weight.", "Store in an airtight container.", "Combine all the dry ingredients together.", "Slowly pour in the water, little by little to make sure that the dough is well-hydrated.", "Mix with chopsticks in a circular motion. The consistency should resemble wet sand.", "Knead it slightly to get the dough together", "Transfer into a ziplock bag. Make sure to get all the air out.", "Rest for 30 minutes.", "After 30 minutes, step on the dough. Stepping is recommended since the dough is too stiff to knead by hand.", "After stepping for 10 minutes, the dough should have little to no dry spots.", "Take the dough out and cut it in half. Put the other half back into the ziplock bag.", "Slightly roll out the dough with a rolling pin. It should not stick at this point.", "Run it at the lowest setting on the pasta machine and laminate the dough by folding it on top of each other and running it through again.", "Flatten the dough using the highest dial.", "Once the dough has been completely flattened, cut using a spaghetti-thickness setting.", "Dust with potato starch and put in an airtight container. The flavor develops better after a day of rest.", "When you’re ready to use the noodles, cook in a large pot with boiling water for 90 seconds. Make sure to loosen the noodles when boiling to ensure that they do not clump to each other.", "Drain thoroughly before dropping gently into a bed of warm hearty broth."]},
{"id": null, "imageURL": "https://doobydobap.com/wp-content/uploads/2021/06/Napjack-39.jpg", "name": "Napjak Mandu", "author": "Doobydobap", "difficulty": "Easy", "servingsize": 4, "preptime": "45minutes", "cookingtime": "15minutes", "ingredients": [{"name": "main", "ingredients": []}, {"name": "Wrappers", "ingredients": ["300 g bread flour", "130-150mL boiling water (This depends on your climate!)", "1 tsp koscher salt"]}, {"name": "Filling", "ingredients": ["300 g firm tofu, drained", "1 cup kimchi, chopped", "1 tbsp soy sauce", "3 tsp chili oil", "1 tsp sesame oil", "1 tsp black pepper", "1 bundle scallions, finely chopped", "1 egg"]}], "directions": ["Mix the flour and salt together. Slowly drizzle in the boiling water in circular motion with chopsticks. ", "Once the dough has formed together, knead for ten minutes. Alternatively, if you find the dough too stiff and your arms are tired, put the dough in a ziplock bag and step on it. I recommend this process because you can also pre-shape the dough into a rectangle. ", "Let the dough rest in the fridge for 30 minutes.", "Drain the tofu. Squeeze the moisture out by using a cheese cloth.", "Put the drained tofu in a large bowl. Add the rest of the ingredients in and mix. ", "Set aside the mixture in the fridge until the dough is ready ", "Divide the dough into 4 equal pieces", "Preform the dough into rectangles using a rolling pin", "Using a pasta machine, feed the dough on the lowest setting", "Fold the dough into thirds. Roll it out with a rolling pin and feed the dough on the lowest setting again. ", "Fold the dough again. This time, roll out by turning the dough 90 degrees. We're laminating the dough to make sure it doesn't crack and to reinforce the gluten structure. ", "Feed the dough through the pasta machine on the lowest setting. ", "Once the dough has laminated, flatten it out until the highest setting. {You can also do this process by hand using a rolling pin!}", "Once the dough is ready, cut into 4 equally sized rectangles. ", "Dollop out 1 tbsp of filling on two of the dough sheets. Aim for 3 cm of dough on each side. ", "Wet the sides of the dough and where the seams will be. ", "Place the dough sheets on top. Press down on the wetted seams to make sure they stick. ", "Once done, put on a floured baking tray with parchment paper. ", "Heat your pan on high. Once the pan has gotten hot, turn the heat down to medium low. ", "Drizzle 1 tbsp of neutral oil.", "Gently place the mandu into the pan. Press down using a spatula. There will be air bubbles, and that's totally normal. Just press it down until it turns golden brown and crispy. This should only take around 2 minutes on each side. ", "Plate and garnish. I chose chili oil and scallions but you can enjoy with soy sauce, black vinegar, peanuts, cilantro, etc... Whatever you want to eat your napjak mandu with! "]},
{"id": null, "imageURL": "https://doobydobap.com/wp-content/uploads/2021/06/Bibimbap-1.jpg", "name": "Bibimbap", "author": "Doobydobap", "difficulty": "Easy", "servingsize": 2, "preptime": "25minutes", "cookingtime": "10minutes", "ingredients": [{"name": "main", "ingredients": []}, {"name": "Rice", "ingredients": ["1 cup for each ddukbaeggi (claypot)."]}, {"name": "Pickled Radish", "ingredients": ["½ daikon radish", "1 tbsp gochugaru (korean red chili flakes)", "2 tbsp sugar", "2 tbsp vinegar", "1 tsp salt"]}, {"name": "Namul (veggie side dishes) for Blanching", "ingredients": ["4 cups spinach (don’t worry they shrink)", "½ tsp sesame oil", "½ tsp salt", "2 cups bean sprouts", "½ tsp sesame oil", "½ tsp minced garlic salt mixture", "½ zucchini", "1 tsp miso", "1 tsp sesame oil", "1 tsp sugar"]}, {"name": "Namul for Stir Frying", "ingredients": ["1 medium carrot", "½ tsp sesame oil", "½ tsp salt", "1 cup mushrooms (shitake, enoki, king oyster, anything works)", "1/2 tsp dark soy", "1 tsp sugar", "1 tsp sesame oil"]}, {"name": "Sauce", "ingredients": ["1 tbsp gochujang (korean chili paste)", "1 tbsp honey", "1 tbsp soy sauce"]}], "directions": ["Prepare the rice in a ddukbaeggi (claypot). Heat on high for the first 5 minutes, then on low heat for another 10-12 minutes.", "Peel the radish. Cut into rounds, then slice diagonally to get a “matchstick” shape around 3cm. (If unsure, look at my video)", "In a large bowl, combine all the ingredients and let it set for 20 minutes.", "Boil water in a medium sized pot.", "Start blanching the beansprouts. It should take only 1 minute— still firm, but not raw. Dress in sesame oil and salt immediately.", "Blanch the spinach and shock in cold water to stop the cooking and to preserve the green color. Then, dress with sesame oil and salt.", "Blanch the zucchini. Combine miso, sesame oil, and sugar and mix with the blanched zucchini.", "Cut the carrots. Sauté them on high heat for 3 minutes. Remove from the pan and dress in sesame oil and salt.", "Sauté the mushrooms with 1 tsp of sesame oil. Once the mushrooms have crisped up, add the soy and sugar. Stir until the sauce has thickened and coated the mushrooms.", "Prepare the gochujang sauce. Mix all the ingredients together.", "Assemble the bibimbap. Optionally, add an egg (raw egg yolk or fried), garnish with sesame seeds and sesame oil.", "Enjoy with the gochujang sauce."]},
{"id": null, "imageURL": "https://doobydobap.com/wp-content/uploads/2021/06/Futomaki-1.jpg", "name": "Futomaki", "author": "Doobydobap", "difficulty": "Medium", "servingsize": 1, "preptime": "15minutes", "cookingtime": "30minutes", "ingredients": [{"name": "main", "ingredients": []}, {"name": "Rice", "ingredients": ["1 cup rice", "235 mL water", "1 piece kombu", "1 ½ sheets nori"]}, {"name": "Sushi Vinegar", "ingredients": ["50 mL rice vinegar", "1 tbsp sugar", "1 tsp Kosher salt", "Futomaki Fillings"]}, {"name": "Tamagoyaki", "ingredients": ["6 eggs", "1 tbsp tsuyu", "1 tbsp dashi stock or water", "1 tsp of neutral oil (for frying)"]}, {"name": "Prawn Tempura", "ingredients": ["2 large prawns", "Dry mixture: 2 tbsp of AP flour + salt", "Wet batter: 2 tbsp of AP flour + salt + 2 tbsp ice water"]}, {"name": "Fish", "ingredients": ["100 g Tuna", "100 g Salmon", "*Feel free to use whatever sashimi that is available to you! The world is your oyster~~ (Maybe not oyster because of its high water content…)", "Orange Masago", "Salmon Roe (for garnish)", "50 g Sweet Pickled Radish (Takuwan)", "½ avocado"]}], "directions": ["Wash your rice. Make sure to rinse the rice thoroughly until the water is almost clear.", "Drain the rice and add the water to the rice. When you put your hand on the rice, the water should barely cover the top of your hand.", "Wipe the kombu with a damp cloth. This helps rid of excess salt or any impurities on the kombu.", "Place the kombu on top of the rice.", "Put the rice in the rice cooker with the glutinous white rice setting selected.", "Make the sushi vinegar: mix all the ingredients together and whisk until the sugar dissolves completely.", "Once the rice is finished, use a rice paddle and fluff the rice around. This helps some of the excess moisture evaporate from the rice", "Transfer the rice onto a flat plate. Best is in a sushi oke (wooden sushi rice bowl used in restaurants) as the rice can have room to cool off. If not, improvise with a baking sheet or a large plate. (Which is what I did!)", "Immediately pour the sushi vinegar liquid over the rice. Make sure to distribute it evenly by pouring on top of your rice paddle moving in a large circular motion.", "Mix the rice gently by flipping. Repeat process until rice is cooled down to room temperature", "Whisk the eggs in a bowl. Make sure to not over mix as that can result in an overly “fluffy” texture.", "Add the tsuyu and the water.", "Strain through a fine mesh sieve for any strands.", "Heat the pan over medium high heat.", "Drizzle neutral oil on the pan and wipe excess oil with a small paper towel.", "When the pan is hot, pour a thin layer of the egg mixture.", "Tilt the pan around to distribute the mixture. Pop any air bubbles with chopsticks.", "Roll the egg into a log starting from the side farthest away from you", "Once a log has formed, pour a second layer of the egg mixture in.", "Make sure to lift the first egg layer log and distribute the new mixture so that it can adhere.", "Repeat the process", "Once finished, transfer to a plate. If you want the tamagoyaki to be in a perfect shape, wrap it with a sushi mat and let cool until it reaches room temperature", "Fill a medium-sized pot halfway with oil and heat until the oil reaches 190C / 375F ", "Prepare the prawns. Twist the head off and remove its shell. Make 2 small incisions on the inside of the prawn where it curls up. This helps the prawns stay straight instead of curling up.", "Prepare the dry mixture and the wet batter. Do not over mix the wet batter", "Coat the prawns in the dry mixture. Dust off excess flour.", "Dip the dusted prawns in the wet batter.", "Once the oil has come up to temperature, drop the prawns in carefully.", "Cook for 2 minutes and pull out once the fry starts floating on top", "Place on a wire rimmed tray and salt immediately", "Cool until room temperature", "Cut the sashimi into long strips. ", "For oilier fish like maguro or fatty tuna, wrap in a cotton tea towel to get rid of excess oil. (Without this process, the oil exuding out from the fish can completely disassemble your roll.)", "Cut the tamagoyaki into a large rectangular prism. This will be the center “pole” of your futomaki.", "Dice the pickled radish into thin slices.", "Peel and slice the avocado. Squeeze some lime juice on top to prevent discoloration.", "Slice the cooled tamagoyaki lengthwise. It should be approximately the same length as the nori or slightly longer", "Place all the ingredients aside and prepare for assembly.", "Fold a sheet of nori in half and cut.", "Attach the ½ sheet of nori to the end of the full nori sheet. Wet the end with water and press the seams together.", "Place the extended nori sheet on top of a bamboo mat", "Create a big rice ball with two hands. Place the rice ball in the center of the nori. Spread the rice evenly to create a rectangle covering ⅔ of the nori.", "Spread the masago and the wasabi evenly from one side of the nori to another", "Gently place the sliced tamagoyaki.", "Next, place your fish in front of the tamagoyaki. The tamagoyaki will act as a shield from the sashimi being squished while rolling.", "Place the shrimp tempura on top of the fish. Then put the pickled radish and avocado on top.", "Be confident. You can do it. Decisively roll the nori using the bamboo mat. Tuck in the fillings as you roll. This will take practice, but once you master it, you’ll get it. It’s like rolling a burrito.", "Try and make sure the start of the rice meets the end of the rice after rolling. For excess nori, wet the edges a little to help the roll adhere.", "Leave the roll in the bamboo mat for 5-10 minutes. This is also a good time to check if there is cold beer in the fridge. If not, place a cold asahi in your freezer now.", "Unroll your roll.", "Slice gently.", "Garnish with roe. (optional)", "Be proud of your creation and marvel at your cross section. (not optional)", "Enjoy with a glass of cold beer."]},
{"id": null, "imageURL": "https://doobydobap.com/wp-content/uploads/2021/06/Steamed-egg-Thumbnail.jpg", "name": "Poktan Gyeranjjim / “bomb” Steamed Egg", "author": "Doobydobap", "difficulty": "Easy", "servingsize": 2, "preptime": "5minutes", "cookingtime": "10minutes", "ingredients": [{"name": "main", "ingredients": ["6 eggs", "150 mL water", "½ tsp kosher salt ", "½ tbsp soy sauce ", "1 tsp sesame oil", "¼ cup carrots, finely diced- leave some for garnish", "¼ cup scallions, finely diced- leave some for garnish", "1 slice American cheese", "1 ddukbaeggi (Korean earthenware pot) 14cm diameter"]}], "directions": ["Crack the eggs into a large bowl. Add the soy sauce, salt, and sesame oil.", "Whisk until homogenous. Strain the eggs through a fine-mesh sieve. This allows the eggs to get a creamy and tender final result. ", "Into the ddukbaeggi, add the water. Heat on high heat.", "Once the water starts to boil, add the carrots and scallions in. ", "Cook for 1 minute. Then, slowly drizzle in the egg mixture in a circular motion. ", "Stir the mixture constantly using a wooden spoon. Make sure the egg doesn’t stick to the bottom and burn. ", "Once the egg mixture is about 70% cooked through, add cheese and garnish (carrot and scallion mixture) on top.", "Cover the ddukbaeggi with a bowl. Make sure it completely covers the ddukbaeggi so that the steam can be trapped inside for the egg to rise to the top. ", "Drop the heat to the lowest setting. Cook the egg for another 5 minutes or until you hear “hissing sounds” from the steam coming out of the bowl. ", "Gently open the lid with oven mitts. Drizzle a little sesame oil and enjoy! "]},
{"id": null, "imageURL": "https://doobydobap.com/wp-content/uploads/2021/06/ScreenShot2021-03-01at11.17.22PM-1.png", "name": "6 Minute Jammy Eggs", "author": "Doobydobap", "difficulty": "Easy", "servingsize": 6, "preptime": "3minutes", "cookingtime": "15minutes", "ingredients": [{"name": "main", "ingredients": ["6 eggs", "½ cup chashu tare (You can substitute with ¼ cup soy, ¼ cup water, 1 tbsp sugar)", "¼ cup soy sauce", "¼ cup sake "]}], "directions": ["Put the eggs in a pot with cold water. ", "Heat the pot on high.", "Once the water starts to simmer, set a timer for 6 minutes.", "After 6 minutes, turn the heat off and immediately shock them in cold water to prevent them from further cooking. ", "Peel carefully. ", "Place in an airtight container with the rest of the ingredients and let it marinate overnight. ", "Cut gently in half with a sharp knife or unwaxed/unflavored floss. "]},
{"id": null, "imageURL": "https://doobydobap.com/wp-content/uploads/2021/06/Thumbnail-45.jpg", "name": "Soondubu", "author": "Doobydobap", "difficulty": "Medium", "servingsize": 1, "preptime": "15minutes", "cookingtime": "10minutes", "ingredients": [{"name": "main", "ingredients": []}, {"name": "Soup", "ingredients": ["1 pack / 350g of soondubu (silken tofu)", "½ cup zucchini, thinly sliced", "1 scallion, thinly sliced", "½ cup clams or protein of choice", "1 egg", "½ -1 tbsp fish sauce (season to your liking)", "¼ tsp sesame oil", "150 mL water* (should only come up to 20% height of your pot)"]}, {"name": "Chili Oil Paste", "ingredients": ["½ onion, finely diced", "2 scallions, thinly sliced", "1 clove of garlic, finely diced", "⅓ cup neutral oil", "3 tbsp gochugaru (Korean chili flakes)", "1 tsp fish sauce", "1 tbsp soy sauce"]}], "directions": ["Add your onion, scallions, garlic, oil to a pot.", "Bring the heat to a medium-low.", "Once the oil comes up to temperature, bring it to a medium-low and cook until caramelized. We’re infusing the oil with the aromatics so low and slow is best! This process should take around 20 minutes for the best caramelization .", "Once the paste has caramelized to a golden brown color, add the gochugaru. [If you’re putting in meat for your soondubu, this is a good time to add it and cook out the meat to get it browned and crispy]", "Toast the gochugaru in the oil. The oil should turn bright red.", "Once the gochugaru has toasted, drizzle the soy sauce and let it slightly burn. This is to add to the aroma and the umami. Add the fish sauce in as well", "Transfer the paste into a separate bowl. The reason why we have a separate paste is to be able to adjust the spiciness to your liking.", "(I add 2 tbsp, but for less spicy add 1 tbsp. If you’d like it to be extra spicy then add a thai chili pepper if you’re feeling bold)", "In an earthenware pot, add your water in. The water should only come to 20% otherwise your soondubu will overflow.", "On high heat, boil the water. Add the zucchini and scallions and cook for 1 minute.", "Drop the clams or seafood into the veggie broth.", "Once the clams have opened, add your paste in.", "Season with fish sauce.", "Turn the heat off and enjoy with a cracked egg. The residual heat will poach the egg. Enjoy! Thanks to those who tuned into my live 🙂"]},
{"id": null, "imageURL": "https://doobydobap.com/wp-content/uploads/2021/08/IMG_2066-768x1024.jpg", "name": "KIMCHI", "author": "Doobydobap", "difficulty": "Difficult", "servingsize": 12, "preptime": "2hours ", "cookingtime": "30minutes", "ingredients": [{"name": "main", "ingredients": []}, {"name": "Salting the cabbage", "ingredients": ["2 large napa cabbage, quartered", "1 cup of Kosher salt"]}, {"name": "Filling", "ingredients": ["1 daikon radish", "1 bundle of scallions", "1 bundle of chives (if not available, substitute with scallions)", "½ cup fish sauce", "¼ cup shrimp paste "]}, {"name": "KIMCHI SAUCE", "ingredients": ["¼ cup white glutinous rice", "2 cups water", "1 cup gochugaru (Korean red chili flakes)", "½ medium-sized onion", "½ Korean pear", "30 g ginger", "1 clove of garlic"]}], "directions": ["Make a 4-5cm deep incision on the rounded bottom of the cabbage.", "Hold either side of the cabbage and pull apart. The cabbage should be halved. (I quartered mine for faster salting)", "Salt the cabbage. Rub in a generous amount of salt in-between the leaves. Massage the salt on the stalkier parts of the cabbage.", "Place the salted cabbage in a ziplock bag or a large container.", "Leave at room temperature for 2 hours, turning it over every 30 minutes.", "Cut the daikon radish into 3cm long \"matchstick\" size.", "Cut the scallions and chives, also in 3cm long \"matchstick\" size.", "Put the fillings in a large bowl.", "Add the fish sauce and shrimp paste. Mix.", "Set aside until kimchi sauce is ready.", "On medium-high heat, boil the rice with water. Stir to make sure the rice does not stick to the bottom of the pan and burn.", "After 20 minutes, the rice and water should have a glue-like texture. If there isn't enough water, add to create a spreadable paste.", "Set aside to cool down.", "Prepare the onion, pear, ginger, and garlic. Give them a rough chop.", "Add the prepared ingredients into a food processor or a blender.", "Mix in ¼ cup of rice glue. Blend", "Once the sauce is ready, add it to the prepared filling.", "Once the cabbage is adequately salted, do a \"bend test.\" The cabbage leaves should be malleable and bendable, not snap. If the cabbage has not wilted enough, leave it in the salt mixture for an additional 30 minutes.", "Rinse the excess salt in running water. Repeat the process.", "Ring out any excess moisture. Place the cabbages on a medium-sized tray.", "Dollop about ½ cup of Kimchi sauce filling mixture for each salted cabbage. Massage the sauce in between the leaves gently. Make sure to cover every part.", "Fold the kimchi in half and place in a medium of your choice (Mason jars, airtight containers, hangari, etc. Anything that can limit too much oxygen exposure)", "For fermented kimchi, place it at room temperature for 3 days and place it in the fridge."]},
{"id": null, "imageURL": "https://doobydobap.com/wp-content/uploads/2021/09/IMG_3991-768x1024.jpg", "name": "Fast & Easy Vegan Japchae", "author": "Doobydobap", "difficulty": "Easy", "servingsize": 4, "preptime": "10minutes", "cookingtime": "10minutes", "ingredients": [{"name": "main", "ingredients": ["200 g dry dangmyun /tapioca / glass noodles", "1 cup blanched or fresh spinach", "1 cup carrot, julienned", "1 cup onion, julienned", "1 bell pepper, julienned (preferably in different colors if you want a colorful japchae like this!)", "15 g dried woodear mushrooms", "¼ cup water", "1 tbsp sesame seeds", "2 tbsp neutral oil"]}, {"name": "Sauce", "ingredients": ["¼ cup light soy sauce", "1 tbsp dark soy sauce", "2 tbsp sugar", "1 tbsp minced garlic", "2 tbsp balsamic vinegar (my secret sauce!)", "2 tbsp sesame oil", "1 tbsp neutral oil"]}], "directions": ["Soak the noodles in cold water for 2 hours until doubled in size. You can also blanch the noodles according to package directions and rinse under cold water to stop cooking further. Soak the dried woodear mushrooms in water and 1 tsp of sugar as well.", "Heat a large skillet on high and drizzle neutral oil in a large skillet.", "Sautee the vegetables on high heat until the onions are translucent, but the vegetables are still crunchy. Make sure not to overcrowd your pan-- if you think that you will overcrowd the pan and steam the vegetables, sautee in batches.", "Set aside the sauteed vegetables.", "In the same pan, add the noodles, water, and sauce in.", "Simmer and stir-fry the noodles in sauce for one to two minutes or until it takes on color.", "Add the sauteed vegetables and mushrooms. Mix.", "Garnish with sesame seeds. Enjoy!"]},
{"id": null, "imageURL": "https://doobydobap.com/wp-content/uploads/2021/09/1-11-819x1024.jpg", "name": "All Purpose Korean Soy BBQ Marinade", "author": "Doobydobap", "cuisine": null, "difficulty": null, "servingsize": 6, "preptime": "10minutes", "cookingtime": "30minutes", "ingredients": [{"name": "main", "ingredients": ["2 cups light soy sauce", "½  cup sugar", "½ cup mirin (For Halal/ non-alcohol options, use rice wine vinegar + 2 tbsp sugar to counteract the sourness! )", "½ cup sake (Can substitute with water)", "½ onion", "½ pear", "12 cloves garlic", "2 tsp sesame oil", "15 g ginger", "1 tsp finely ground black pepper", "2 kg LA Kalbi cuts or Korean short rib cuts"]}], "directions": ["Blend everything together.", "Soak the short ribs in cold water for at least an hour to clean the blood and excess gunk on meat.", "Drain the water and rinse the short ribs.", "Add the marinade to the short ribs.", "Place the marinated short ribs in a sealed container and marinate in the fridge overnight.", "After the meat has finished marinating, you can divide it into smaller portions and keep in the fridge for future use.", "There are three ways to cook these short ribs: braise, grill, and in the oven. Braising will yield the most tender result. It's also super easy and the quickest. Braise the short ribs in a large pan with ½ cup of the marinade and ½ cup of water. Simmer on medium-low heat until the glaze becomes sticky and the meat becomes caramelized.", "Grilling will yield a nice char and smokiness. Grilling short ribs is a great way to spice up your summer grilling. Grill on each side for 2 minutes.", "Using the oven or an airfryer is a great way to cook large portions. Place the ribs on a aluminum lined or parchment lined baking sheet with ½ cup marinade and bake at 160C for 30 minutes flipping mid-way through. Finish by broiling for 30 seconds on each side or torch for an added char and smokiness.", "If your local asian grocer doesn't carry bulgogi cuts, get a philly cheese steak cut! You can also opt to put a ribeye steak and freeze for 30 minutes to make it easier to shave into thin slices. You can also have thinly sliced pork belly for dwaeji bulgogi as well."]},
{"id": null, "imageURL": "https://doobydobap.com/wp-content/uploads/2021/10/42-819x1024.jpg", "name": "Crispy Tuna Avocado Rice Burger", "author": "Doobydobap", "difficulty": "Medium", "servingsize": 2, "preptime": "1hour ", "cookingtime": "15minutes", "ingredients": [{"name": "main", "ingredients": []}, {"name": "Crispy Rice", "ingredients": ["500 g freshly made sushi rice", "3 tbsp rice wine vinegar", "2 tbsp white sugar", "1 tsp salt", "Neutral oil for frying", "Fillings"]}, {"name": "Negi Toro", "ingredients": ["200 g fatty tuna aka toro", "1 lime", "½ cup green onion, finely sliced", "20 g masago (optional)", "1 Avocado", "1 tsp kosher salt"]}, {"name": "Sauce", "ingredients": ["2 tbsp light soy sauce", "½ tbsp lime juice", "1 tsp honey", "1 tsp wasabi"]}], "directions": [" Prepare the sushi vinegar. Mix the ingredients and microwave for 30 seconds or until the sugar has dissolved. ", " Prepare a large bowl. Add the sushi rice to the bowl and fan any steam that rises so that the rice does not get too mushy. ", " Add the sushi vinegar by pouring it gently onto the rice paddle and distributing it evenly on the rice. ", " Fold the rice gently. ", " Cover with kitchen linen and let the rice absorb the vinegar for 5 minutes. ", " Line a baking tray with plastic wrap. ", " Add the sushi rice to the baking tray and spread it evenly. The thickness should be around 1cm/half an inch. ", " Cover with another layer of cling film and place another baking tray on top. Apply pressure so that the rice can stay compact and together. ", " Rest in the fridge for at least 1 hour. If you’re impatient like me, add ice on the top of the baking tray and on the bottom to cool the rice faster. ", "10. Use a small rice bowl and wet the bowl with water. ", "11. Punch out the cooled sushi rice into a circular rice disk using the rice bowl, and place the disk on top of parchment paper. ", "12. Heat a heavy-duty pot with neutral oil. You can also pan-fry on a non-stick pan. Heat on high until the oil reaches 165C /330F. ", "13. Gently place the rice disk into the oil. Fry until golden brown or for about 2 minutes on each side. ", "14. Take the crispy rice out of the oil and onto a lined baking tray. Let it rest while preparing the fatty tuna patty. ", "15. Finely mince the fatty tuna. Make sure that the tuna is slightly frozen because if it’s room temperature, it will turn to mush due to the high-fat percentage. ", "16. Add kosher salt, zest from 1 lime and lime juice from half of the lime. Reserve the other half of the lime for later. Optionally, add the masago for a “popping” texture.", "17. Assemble the burger by brushing the sauce, half of the tuna patty, minced scallions, and half of a thinly sliced avocado. Season the avocado with salt and extra lime juice. ", "18. Put the other rice bun on top. If you’d like it to stay compact like mine, wrap it tightly with plastic wrap. Enjoy!!!"]},
{"id": null, "imageURL": "https://doobydobap.com/wp-content/uploads/2021/10/frame-001745-819x1024.jpg", "name": "Dak Jook", "author": "Doobydobap", "difficulty": "Easy", "servingsize": 4, "preptime": "10minutes", "cookingtime": "15minutes", "ingredients": [{"name": "main", "ingredients": ["1 Whole Chicken", "1 Cup white rice", "1 cup carrot, finely diced", "1 cup zucchini, finely diced", "½ cup leek/ scallion, finely diced", "10 garlic cloves", "1 slice ginger", "1 tsp sesame oil", "If using a pressure cooker: 5 cups water", "If stove cooking: 10 cups water", "1 tbsp soy sauce", "1 tsp kosher salt"]}], "directions": ["Rinse the rice. Rub between the palms of your hand. Repeat another 6 times.", "Soak the rinsed rice in cold water for 30 minutes. This process ensures that the individual granules are evenly plump, which cuts down cooking time and allows for even cooking.", "Add the soaked rice, chicken, garlic, ginger and water to the pressure cooker / pot. If using a pressure cooker, cook for 15 minutes and let it rest for 5 minutes before releasing the steam. If stove cooking, make sure to whisk constantly to ensure that the rice does not burn on the bottom. Cook for approximately 30 minutes or until the chicken has cooked through properly.", "Add the finely diced vegetables. Cook for another five minutes.", "Turn the heat off and add the sesame oil for aroma. Enjoy!"]},
{"id": null, "imageURL": "https://doobydobap.com/wp-content/uploads/2021/10/IMG_5190-768x1024.jpg", "name": "Pork Adobo", "author": "Doobydobap", "difficulty": "Easy", "servingsize": 4, "preptime": "10minutes", "cookingtime": "1hour ", "ingredients": [{"name": "main", "ingredients": ["800 g thick pork belly", "½ cup soy sauce", "½ cup vinegar", "1 tbsp brown sugar", "20 cloves garlic", "1 slice ginger", "1 tbsp whole black peppercorns", "5 bay leaves", "½ cup water (omit water if using pressure cooker)", "Jasmine rice to serve with", "1 tbsp neutral oil"]}], "directions": ["Cut the pork belly into sizeable chunks. I like to have it 4cm width and 3cm thickness but cut to your liking. (Cutting it smaller will reduce the cooking time)", "Prepare a large dutch oven or skillet. On high heat, drizzle in neutral oil and sear the pork belly until light golden brown on each side.", "Take the pork belly out and lower the heat to a medium-low. ", "Add the garlic, ginger, and black peppercorns. Stir to bloom the spices and aromatics, or until the garlic has turned to a pale golden color.", "Add the soy sauce, vinegar, and brown sugar to simmer. ", "Add the bay leaves and the pork belly into the mixture. Heat on high if the mixture has stopped simmer and turn the heat back to low on a rolling simmer. ", "Prepare parchment paper and cut a hole in the middle. Place the parchment paper on top of the liquid. This method is called cartouche and it is extremely effective at controlling the amount of liquid evaporated and ensuring that the pork belly is submerged and tender at all times. You can also leave the lid slightly ajar! ", "Simmer on low heat for 1 hour. Alternatively, stick it in a preheated oven at 325F/ 165C for 1 hour and 30 minutes. You can also use a pressure cooker without the water for 15 minutes on high pressure and 5 minutes rest before releasing the steam.", "Serve on top of jasmine rice and enjoy! "]},
{"id": null, "imageURL": "https://doobydobap.com/wp-content/uploads/2021/10/1-1-819x1024.jpg", "name": "Garlic Tongdak", "author": "Doobydobap", "difficulty": "Medium", "servingsize": 1, "preptime": "30minutes", "cookingtime": "30minutes", "ingredients": [{"name": "main", "ingredients": ["1 whole chicken"]}, {"name": "Batter", "ingredients": ["½ cup AP Flour", "½ cup Corn starch", "½ tbsp turmeric powder", "1 cup ice water"]}, {"name": "Garlic Sauce", "ingredients": ["5 garlic bulbs", "2 garlic cloves (optional)", "1 tbsp olive oil", "½ tbsp sesame oil", "1 tbsp honey", "1 tsp black pepper", "1 tsp kosher salt", "Oil to fry"]}], "directions": ["Place the garlic bulbs on aluminium foil and drizzle in olive oil. Wrap it tightly and bake at 250C / 400F for 30 minutes", "Squeeze out the baked garlic cloves. Add in rest of the ingredients. For more garlicky heat, microplane raw garlic in the sauce at the end. ", "Spatchcock the chicken. Cut down the center of the chicken breast. Pop open the center collar bone and flatten. Dislocate the joint connecting the thigh to the body so that the chicken lays flat. ", "Pat the chicken dry with a paper towel and salt liberally. Keep it uncovered in the fridge for at least an hour, up to overnight. This process allows all the excess moisture to be drawn out of the chicken and a crispier fry. ", "Prepare a large pot with ample oil to fry. Heat on high until the oil reaches 170C / 340F. (We’ll be frying it twice, once at a lower temperature around 160C/320F and again at 180C/355F. You want the oil to be higher because the temperature will drop once we put the chicken in!) If you don’t have a thermometer, fry a small piece of chicken in- the chicken should drop till the middle of the oil and slowly bounce back up, with a clear sizzling sound. ", "Prepare the batter and dip the chicken. Make sure the batter coats all of the chicken. ", "Gently drop the chicken into the oil. ", "Using a sieve, fish out any of the excess batter that floats to the top. You might think that there’s not enough batter on the chicken and that the chicken looks.. naked. Trust the process, the batter should be so thin that it barely covers the chicken and the result will be super golden brown and crunchy. ", "Fry on each side for about 10 minutes on each side. The cook time will depend on the size of the bird. It should be around 6 minutes per pound of meat. ", "Take out once golden and let it rest for 10 minutes. ", "Heat the oil back on high to 180C and double-fry again for 1 minute on each side.", "Place the chicken on a wired rack and let it rest again.", "Smother in the garlic sauce and enjoy!"]},
{"id": null, "imageURL": "https://doobydobap.com/wp-content/uploads/2021/10/14-2-819x1024.jpg", "name": "Matcha Chocolate Chip Cookies", "author": "Doobydobap", "difficulty": "Easy", "servingsize": 12, "preptime": "45minutes", "cookingtime": "15minutes", "ingredients": [{"name": "main", "ingredients": []}, {"name": "Matcha cookie dough", "ingredients": ["100 g butter, room temperature", "100 g sugar", "150 g AP flour", "1 tbsp matcha powder", "1 tsp baking powder", "1 tsp salt", "1 egg", "1 tsp vanilla extract"]}, {"name": "Chocolate cookie dough", "ingredients": ["100 g butter, room temperature", "100 g sugar", "150 g AP flour", "1 tbsp cocoa powder", "1 tsp baking powder", "1 tsp salt", "1 egg", "1 tsp vanilla extract", "Semi sweet 70% dark chocolate or nuts of your choice"]}, {"name": "Matcha Latte", "ingredients": ["300 mL cold milk (oatmilk, almond milk, all work)", "½ tbsp matcha powder", "1 tsp honey", "50 mL warm water", "ice"]}], "directions": ["Preheat the oven at 180C / 355F", "In a medium sized bowl, add room temperature butter and sugar. Whisk until smooth and slighitly fluffy.", "Add the vanilla extract and crack 1 egg into the mixture. Whisk until combined. ", "Sift in flour, baking powder, matcha and salt. ", "Mix until there are no dry spots. ", "Repeat the process for the chocolate cookie dough.", "The dough should feel slightly wetter than normal cookie dough. This allows the cookies to be slightly crispy on the outside but ooey-gooey on the inside. ", "Using a icecream scooper, scoop ½ tbsp of the matcha dough in first on one side.", "Fill the rest with chocolate cookie dough. At this point, if you want a more marbled effect, use a toothpick to swirl along the where the two doughs meet. ", "Dollop the cookie mixture into a parchment lined baking tray. Make sure to have ample space inbetween the cookies!! My first batch was way too close and it ended up becoming attached to each other.⁣", "Bake at 180C / 355F for 12-15 minutes depending on how you like your cookies, super gooey or slightly crispy!"]},
{"id": null, "imageURL": "https://doobydobap.com/wp-content/uploads/2021/10/3-4-819x1024.jpg", "name": "Best Beef Hayashi Omurice", "author": "Doobydobap", "difficulty": "Medium, Difficult", "servingsize": 4, "preptime": "15minutes", "cookingtime": "45minutes", "ingredients": [{"name": "main", "ingredients": []}, {"name": "Hayashi Sauce", "ingredients": ["2 onions, thinly chopped", "250 g thinly sliced beef or protein of choice! (mushrooms work well too)", "1 packet S&B Hayashi rice sauce block", "1 cup marinara or canned tomato", "½ cup red wine", "2 cups chicken stock", "2 tbsp soy sauce", "2 tbsp ketchup", "2 tbsp bulldog sauce", "3 tbsp butter (2tbsp for onions, 1 tbsp for finishing sauce)"]}, {"name": "Omurice", "ingredients": ["4 eggs", "½ tsp kosher salt", "1 tbsp neutral oil or butter", "1 ½ cup freshly cooked white rice"]}], "directions": ["Caramelize the onions. Prepare a large pot and heat on high. Once the butter has melted, add the sliced onions.", "Bring the heat to a medium and stir to make sure that the onions cook evenly. Supplement with neutral oil if the onions start burning and sticking.", "After 10-15 minutes, the onions should be golden. Bring the heat back up to high and add beef and stir it around with the onions so it’s not in big chunks.", "Add marinara, red wine, chicken stock.", "Once the mixture comes up to boil, add the S&B Hayashi rice sauce block. Mix to combine.", "Add soy sauce, ketchup, and bulldog sauce. And simmer for another 10 minutes.", "Turn the heat off and finish with 1 tbsp of butter. This makes the sauce silky and glossy.", "Cover with lid and let it rest— this will help the sauce thicken up and ensure that it’s not piping hot. Alternatively, cool and put in the fridge overnight. This will allow the flavors to deepen!", "Crack the eggs and mix well until homogenous.", "Pass the mixture through a sieve.", "Season with salt.", "Prepare a medium-sized non-stick skillet.", "Heat on medium-high heat. Melt butter or drizzle neutral oil.", "Once the oil has melted, add the egg mixture.", "Shake the pan while whisking the mixture with a rubber spatula.", "Once the eggs have a runny scrambled texture, tilt the pan to bring the mixture to the bottom of the pan.", "Slowly rotate the omelette to close the seam. The omelette should be in a rugby-ball shape. Once the seam has been closed, gently place the omelette on top of the rice. The rice should also be in a steep rugby shape so that the omelette can unfold once cut open.", "Ladle on a generous portion of the hayashi sauce on top of the omurice. Enjoy!"]},
{"id": null, "imageURL": "https://doobydobap.com/wp-content/uploads/2021/10/00-768x1024.jpg", "name": "Fried Eggplants with Doubanjiang Sauce", "author": "Doobydobap", "difficulty": "Easy", "servingsize": 2, "preptime": "10minutes", "cookingtime": "15minutes", "ingredients": [{"name": "main", "ingredients": ["2 eggplants", "1 tbsp kosher salt", "1 scallion, finely diced", "2 cloves garlic, finely diced", "¼ cup carrot, finely cubed", "¼ cup red paprika, finely cubed", "¼ cup yellow paprika, finely cubed", "1 tbsp potato starch", "1 tbsp neutral oil", "Neutral oil for frying"]}, {"name": "Sauce", "ingredients": ["1 tbsp oyster sauce (Use vegan oyster sauce if you want it to be plant-based!)", "1 tbsp soy sauce", "1 tbsp doubanjiang", "1 tsp minced garlic", "1 tsp minced ginger", "1 tsp chili oil (optional)", "1 tsp sesame oil", "1 tbsp water"]}], "directions": ["Cut the eggplants into large chunks. The key is so that the eggplant has 4 exposed sides so it can get extra crispy. Do this by cutting the eggplant on a slanted edge and rotating while cutting.", "Put the eggplant chunks into a large bowl and salt. Rest for 15 minutes. This process helps draw out some of the moisture from the eggplant.", "Squeeze out excess moisture using a kitchen towel.", "Coat the eggplant in potato starch.", "Prepare a heavy-duty pot to fry the eggplants.", "Gently drop the coated eggplant into the oil. Fry at 165 for 3-4 minutes. At this point, it should be a pale golden color.", "Take the eggplant out of the oil and onto a wired baking tray.", "Crank the oil temperature up to 175C and double fry for 1 minute or until golden brown.", "Serve with sauce on top. Enjoy!", "In a saucepan, add neutral oil, scallions, and garlic. Sautee at high heat for 1 minute.", "Add the cubed carrot and sautee for another 1 minute.", "Then add the paprika and saute for another 1 minute.", "Add the sauce in and simmer until thickened."]},
{"id": null, "imageURL": "https://doobydobap.com/wp-content/uploads/2021/11/IMG_7482-819x1024.jpg", "name": "Buseot Sot Bap", "author": "Doobydobap", "difficulty": "Medium", "servingsize": 4, "preptime": "15minutes", "cookingtime": "15minutes", "ingredients": [{"name": "main", "ingredients": ["3 cups short-grain white rice (sushi rice)", "2 ½ cups water", "4 cups mushroom of choice (I used enoki, oyster mushroom, shitake, and king oyster!)", "2 tbsp soy sauce"]}, {"name": "Sauce", "ingredients": ["3 tbsp red miso paste", "3 tbsp soy sauce", "3 tbsp honey", "1 tsp sesame oil", "1 tbsp butter for pot rice", "1 tbsp butter for pan-frying mushrooms"]}], "directions": ["Prep the mushrooms. Rip into bitesized pieces or slice thinly. ", "Rinse the rice. Rub the granules against the palms of your hands. Repeat the process at least 7 times or until the water runs clear.", "Soak the rice in cold water for 30 minutes.", "Drain the soaked rice and transfer it into a heavy-duty pot.", "Add water, soy sauce, and mushrooms on top.", "Close the lid and heat on high until the mixture starts to boil.", "Lower the heat to the lowest setting and cook for 12 minutes.", "While the rice is cooking, score the king oyster mushroom diagonally. Make sure to not go all the way and only ⅓ of the way down.", "Heat the skillet on medium-high heat and melt butter.", "Once the butter starts foaming, place the king oyster mushroom scored side down. Turn the heat to a medium.", "Press down on the middle part of the oyster as it fries. The oyster may start curling from the heat, and this allows for an even crust.", "Turn the heat off. Let the rice rest, lid on. This process allows the rice to cook evenly from the residual heat and for perfectly fluffy beautiful rice.", "Add 1 tbsp of butter while the rice is warm. Place the roasted mushrooms on top.", "Pour the miso sauce over the rice. Gently mix with a wetted rice paddle. Enjoy!"]},
{"id": null, "imageURL": "https://doobydobap.com/wp-content/uploads/2021/12/IMG_8578-2-863x1024.jpg", "name": "Vegan Tomato Cabbage Roll Stew ", "author": "Doobydobap", "difficulty": "Easy", "servingsize": 8, "preptime": "10minutes", "cookingtime": "20minutes", "ingredients": [{"name": "main", "ingredients": ["8 cabbage leaves", "1 cup pureed tomato sauce", "1 cup veggie stock", "1 tbsp neutral oil", "Olive oil, parsley, and vegan sour cream for garnish"]}, {"name": "Filling", "ingredients": ["1 firm tofu", "½ cup onion, finely diced", "½ cup carrot, finely diced", "1 cup warm cooked rice*", "2 tbsp vegan oyster sauce", "1 tbsp soy sauce", "pinch salt", "black pepper"]}], "directions": ["Flip the cabbage and make 1 inch deep incisions to peel the cabbage leaves.", "Blanch the cabbage leaves. Place the cabbage leaves into boiling water and cover. Cook for 3 minutes or until the leaves are tender and slightly translucent.", "Dab any excess moisture from the cabbage leaves.", "Remove any large stems.", "Drain the tofu. Place the tofu on a clean linen towel and squeeze out excess moisture.", "Place the drained tofu in a large bowl.", "Add the rest of the ingredients. Mix.", "Scoop ½ cup of the filling into the center of the cabbage leaves.", "Tuck the sides of the leaves and roll into a tight roll.", "Oil a heavy-duty pot and place the cabbage leaves seam side down.", "Heat on high heat until the pot comes up to temperature and the rolls start sizzling.", "Cook until the bottom has turned golden brown for about 5 minutes.", "Add the tomato sauce and stock.", "When the sauce starts simmering, reduce the heat to medium-low.", "Cover the pot with the lid slightly ajar. Simmer for 15 minutes or until the cabbage has turned translucent.", "Serve with olive oil, vegan sour cream, and parsley. Enjoy!"]},
{"id": null, "imageURL": "https://doobydobap.com/wp-content/uploads/2021/08/IMG_0846-844x1024.jpg", "name": "Katsudon", "author": "Doobydobap", "difficulty": "Easy", "servingsize": 2, "preptime": "15minutes", "cookingtime": "15minutes", "ingredients": [{"name": "main", "ingredients": ["2 pork shoulder/loin steak or filleted chicken breast/thigh (150g)", "1 white onion, thinly sliced", "1 egg", "2 cups cooked white rice", "chives for garnish", "1 cup AP flour", "2 cups panko breadcrumbs", "Neutral oil for frying"]}, {"name": "Batter", "ingredients": ["½ cup AP flour", "½ cup water", "1 egg", "1 tsp salt"]}, {"name": "\u2028\n**Sauce", "ingredients": ["1 cup stock (dashi, chicken, veggie all works!)", "2 tbsp sake", "2 tbsp mirin", "2 tbsp soy sauce", "2 tbsp sugar"]}], "directions": ["Pat the meat down with a kitchen towel. ", "Using the back of your knife or a meat hammer, tenderize the meat. Aim for the meat to be in even thickness to ensure that the katsu cooks evenly. ", "Season the meat with a generous amount of kosher salt and pepper. ", "Prepare the assembly line: pour flour into a rimmed baking tray, batter in a bowl, and panko into a baking tray. ", "Heat your oil on medium-high heat. ", "Coat the meat in the flour. Make sure to get every side coated. Dust off any excess flour. (Use right hand)", "Drop the floured meat into the batter. Coat both sides. Let excess batter drip off. (Use left hand)", "Tightly pack the cutlet with panko. Press down firmly so that the panko can stick on. ", "Test the oil temp. If you don't have a thermometer, drop a bit of the batter into the oil. The batter should sink to the middle for half a second and pop right up to the top sizzling. If you have a thermometer, aim for 180C/ 355F. The oil temperature is slightly higher than your average frying temperature at this point because we're accounting for the meat to drop the temperature to around 176C / 350F. ", "Gently drop the katsu away from your body so that the oil won't splatter on you.", "Fry on each side for 2 minutes or until golden brown. ", "Crank the heat up high for the final 30 seconds before taking the katsu out on a wired baking tray. ", "Let the katsu rest. This resting process helps the meat absorb its juices and residual heat to make the katsu crispier. ", "In a small nonstick pan or a donburi pan, add the sauce. ", "Heat on high until the sauce starts simmering. ", "Add half of the sliced onions. Cook until the onions have turned slightly translucent. ", "Beat one egg. Do not overbeat as this will incorporate too much air. ", "Drizzle in the egg mixture on top of the sauce in a circular motion, starting from the center. ", "Cook the mixture for additional 30 seconds. Turn the heat off when the egg is still runny in the center. The residual heat will cook the egg. ", "Cut the katsu into bite-sized pieces. Place on top of rice. ", "Gently pour the sauce on top. ", "Garnish with chives. Enjoy!"]},
{"id": null, "imageURL": "https://doobydobap.com/wp-content/uploads/2021/08/23-copy-1024x944.jpg", "name": "Kong Guksu", "author": "Doobydobap", "difficulty": "Easy", "servingsize": 4, "preptime": "4hours ", "cookingtime": "30minutes", "ingredients": [{"name": "main", "ingredients": ["2 cups dried soybeans", "¼ cup tahini or peanut butter", "½ cup cashews", "½ cup pine nuts", "Somen noodles", "Sugar or salt to taste"]}], "directions": ["Soak the soybeans in cold water for 4 hours and up to overnight. ", "Drain the soybeans and cover the beans with cold water. Boil for 15 minutes until the beans are soft but still with a bite with the heat on high. ", "Reserve the liquid. ", "Cold shock the beans and rub the beans against the palm of your hands. This process will help take off some of the shells on the beans. I don’t mind it, so I leave it on, but it’s up to you! ", "Transfer the cooked beans and transfer into a blender.  ", "Add the reserved cooking liquid a little by little until a smooth, creamy consistency. ", "Cook the somen noodles according to package instructions.", "Cold shock the somen noodles and rinse under cold water to get rid of the excess starch. ", "Pour the sauce over the noodles. Enjoy with sugar or salt to taste! "]},
{"id": null, "imageURL": "https://doobydobap.com/wp-content/uploads/2021/08/IMG_1093-1-768x1024.jpg", "name": "Fried Dumplings Skirt", "author": "Doobydobap", "difficulty": "Medium", "servingsize": 40, "preptime": "45minutes", "cookingtime": "15minutes", "ingredients": [{"name": "main", "ingredients": []}, {"name": "Filling", "ingredients": ["250 g ground pork (can use ground chicken or drained tofu!)", "½ nappa cabbage, thinly sliced", "1 tbsp kosher salt", "1 tsp minced ginger", "1 tbsp minced garlic", "½ tsp white pepper (can be substituted with black pepper)", "1 tsp sesame oil", "1 tbsp neutral oil"]}, {"name": "Assembly / Frying", "ingredients": ["1 pack gyoza wrappers", "2 tsp AP flour", "2 tbsp neutral oil"]}, {"name": "Slurry", "ingredients": ["1 tsp corn starch", "75 mL or ⅓ cup cold water"]}, {"name": "Dipping sauce", "ingredients": ["1 tsp light soy sauce", "1 tsp chili oil", "1 tsp chinese black vinegar", "½ tsp minced garlic (optional)"]}], "directions": ["Transfer the thinly sliced napa cabbage into a big bowl. ", "Add salt and massage the cabbages and let them sit for 10 minutes. ", "After 10 minutes, there should be moisture coming out from the cabbage. Squeeze the cabbages for excess moisture and drain. ", "Add the ginger, garlic, white pepper, sesame oil, and neutral oil.", "Mix until a homogenous mixture forms. ", "To pleat the dumplings, wet half of the circumference of the wrapper. ", "Add ½ tbsp of your filling in the center. I like to use a measuring spoon because it makes lovely little mounds!", "Fold the wrappers in half. Pinch the center of the dumpling and create two pleats on either side of the dumplings. ", "Press the seams firmly to make sure the dumplings do not fall apart. You’ll get better with practice— don’t worry!", "Place your dumplings on a lightly floured baking tray. ", "Heat your pan on medium-high. ", "Once the pan has come up to temperature, drizzle in oil. ", "Place the dumplings in a circular motion. ", "Fry uncovered for 2-3 minutes or until the bottom is lightly golden brown. ", "Once the bottom is lightly golden brown, add your slurry. ", "Close the lid and drop the heat to a medium-low. ", "Cook anywhere between 5-10 minutes, depending on whether you have fresh dumplings or frozen dumplings. ", "Once the dumpling skin looks translucent, open the lid and cook out any excess water to crisp up the wing!", "At this time, add an extra drizzle of neutral oil to help the wing release from the pan easily. ", "Once the wing is golden brown, turn the heat off. Use a spatula to make sure that the gyozas have separated from the pan. ", "Place a plate on the pan and flip. ", "Enjoy with sauce!"]},
{"id": null, "imageURL": "https://doobydobap.com/wp-content/uploads/2021/08/IMG_0955-768x1024.jpg", "name": "Miso Walnut Rice Balls", "author": "Doobydobap", "difficulty": "Easy", "servingsize": 4, "preptime": "10minutes", "cookingtime": "15minutes", "ingredients": [{"name": "main", "ingredients": ["3 cups room temperature cooked short grain rice (aka sushi rice)", "1 cup walnuts", "1 tbsp light soy sauce", "1 tbsp dark soy sauce (can be substituted with light soy)", "1 tbsp miso paste", "1 tbsp honey", "1 tsp sesame oil", "1 tbsp butter"]}], "directions": ["Pulverize the walnuts in a food processor or using a rolling pin. ", "On medium heat, add the walnuts to a small skillet. ", "Toast the walnuts on medium heat for 2-3 minutes until golden brown, and you can smell a nutty aroma. ", "Then, add the soy sauce, miso paste, honey, and sesame oil. ", "Cook out the mixture until it’s thickened into a paste-like texture. ", "Transfer the paste into the cooked rice. ", "Mix to combine. ", "Dip your hands in water. ", "Scoop 1 cup of rice and form into a ball or to your desired shape. ", "Let it rest in the fridge for 30 minutes. ", "For ovens, bake for 20 minutes on each side, for a total of 40 minutes. To make the riceballs crispier top, broil them for 30 seconds on each side for the extra crunch.", "For air fryers, bake for 20 minutes at 400F. For an even crispier finish, crank the heat to the maximum with an extra brushing of oil. ", "For pan-frying, heat the skillet on medium-high. ", "Once the pan warms up, add the butter. ", "Once the butter has melted, add your rice balls gently into the pan. ", "Sear on both sides for 2-3 minutes or until crispy and golden brown. ", "Enjoy!"]},
{"id": null, "imageURL": "https://doobydobap.com/wp-content/uploads/2021/08/IMG_7662-768x1024.jpg", "name": "Jjambbong", "author": "Doobydobap", "difficulty": "Medium", "servingsize": 2, "preptime": "30minutes", "cookingtime": "1hour ", "ingredients": [{"name": "main", "ingredients": ["1 cup cabbage, thinly sliced", "½ onion, thinly sliced", "½ cup zucchini, julienned into “matchstick” size", "½ cup carrots, julienned into “matchstick” size", "2 cups fresh mussels or clams", "1 cup seafood mix (squid, shrimp, or any seafood of your preference)", "2 L chicken broth", "2 packets ramen noodles", "1 tbsp fish sauce", "1 tbsp oil"]}, {"name": "\u2028\n**Chicken Broth", "ingredients": ["1 chicken carcass", "2 L water", "1 tbsp chicken powder"]}, {"name": "\u2028\n**Chili Oil Sauce", "ingredients": ["⅓ cup finely diced leek", "1 tbsp minced garlic", "½ cup neutral oil ", "3 tbsp fine gochugaru", "2 tbsp soy sauce", "½ tsp white pepper or freshly ground black pepper"]}], "directions": ["If making broth from scratch, cut the chicken carcass into chunks and cover it with water. Heat on high heat until rolling boil, then drop the heat to a medium. Put the lid on slightly ajar and skim any excess scum. Boil for 45 minutes. Supplement with extra water if necessary.", "Once the broth is finished, take out the carcass and add 1 tbsp of chicken powder. Mix to combine.", "Add oil and leek into a medium-sized skillet. ", "Heat on medium heat until the leek is translucent / slightly golden-brown. ", "Once the leeks have been infused into the oil, add minced garlic. ", "Turn down the heat to the lowest setting and stir to ensure that the garlic does not burn. ", "Add the gochugaru into the oil. Mix until the oil is a bright-red hue. ", "Turn the heat off and drizzle in soy sauce on the edge of the pan. You will smell a slightly burnt-soy smell. This is key to making sure that your broth will have a deep smoky umami broth. ", "Finish with some white pepper and transfer into a separate container. If you’re not making jjambbong right now, you can put it in an air-tight container and store it in the fridge for up to five days. You can use this sauce for soondoobu jjigae as well! ", "Heat a large skillet on high heat. Once the skillet starts to smoke, take it off the stove and drizzle in 2 tbsp neutral oil. ", "Turn the heat back on high and add the thinly sliced veggies into the pan. Make sure not to overcrowd the pan because we don’t want the veggies to steam! ", "Let the veggies char and wilt slightly. Toss to combine. The veggies should still have a crunch but have char on the outside. This process will take 2-3 minutes. You can also opt to put in 2 tbsp of high-proof alcohol and flambé the veggies! ", "Transfer onto a separate tray. ", "Heat a large wok/pot on high. Once the wok starts to smoke, drizzle in oil. ", "Add your seafood mix and mussels. Cook for 30 seconds or until the mussels start to open up slightly. Then add your chicken stock and chili oil sauce. ", "During this time, cook your ramen noodles al dente. Rinse under cold water to firm up the noodles and rid of excess starch. ", "Once the soup comes up to boil, add the fish sauce in. Taste and add more fish sauce if needed. Ladle the broth on top of the noodles to warm it up. Then put the veggies and mussels for a beautiful presentation. Enjoy! "]},
{"id": null, "imageURL": "https://doobydobap.com/wp-content/uploads/2021/08/tangsuyook-photo-779x1024.jpg", "name": "Tangsuyook (Sweet & Sour Pork)", "author": "Doobydobap", "difficulty": "Medium", "servingsize": 2, "preptime": "30minutes", "cookingtime": "30minutes", "ingredients": [{"name": "main", "ingredients": ["500 g Pork tenderloin (Chicken thigh works too!)", "2 tbsp soy sauce", "2 tbsp mirin", "1 tsp kosher salt", "½ tsp black pepper", "1½  cup potato starch", "2 cups water", "1 tbsp neutral oil", "Oil for frying"]}, {"name": "Sauce", "ingredients": ["1 cup green/red / yellow bell pepper, cubed", "⅓ carrot, thinly sliced", "1 tbsp neutral oil", "⅓ cup ketchup", "1 tbsp soy sauce", "2 tbsp rice wine vinegar", "2 tbsp sugar", "⅓ cup reserved pineapple liquid", "½ cup water", "1 tsp potato starch for slurry"]}], "directions": ["Let’s prepare the batter first. This potato starch batter is probably very different from what you’ve seen before. It has non-newtonian properties that feel neither solid nor liquid. This super cool batter yields an extremely crispy fry with a slight chew in the center. ", "Add the potato starch and water into a large bowl. Let the potato starch hydrate for 30 minutes. ", "Marinate the thinly sliced pork with soy sauce, mirin, salt, and black pepper. Let it marinate while the starch hydrates. ", "Once the potato starch has hydrated, the water and the starch will separate. Pour out all but 2 tbsp of the liquid. ", "Add 1 tbsp of neutral oil. Adding neutral oil will add a nice sheen to the batter, and once the temperature rises, the oil will try and escape from the batter giving it an airy structure. ", "Mix using your hands. ", "Add the marinated pork into the batter. The batter should feel unusually stiff and may seem hard to adhere to the pork at first but will stick once massaged. ", "Fry at 175C for one to two minutes or until the fried pork starts rising to the top of the oil. Agitate the pork for an even golden-brown fry. ", "Take out the pork on a rimmed baking tray. ", "Crank the heat up on the oil until it reaches around 185C. ", "Fry the pork again, only for 30 seconds to make it even crispier. ", "Take it out on a rimmed baking tray and let it rest while assembling the sauce. ", "In a large saucepan, saute the bell peppers and carrot with 1 tbsp neutral oil. ", "Mix ketchup, soy sauce, vinegar, sugar, and pineapple liquid together. Add the mixture to the sauteed veggies. ", "Cook the sauce until it starts to thicken. Add the pineapples in at this point. ", "Combine water and potato starch. Gently pour the mixture into the pan. ", "Let the sauce thicken. Transfer to a separate bowl. Enjoy with the tangsuyook!"]},
{"id": null, "imageURL": "https://doobydobap.com/wp-content/uploads/2021/08/1-8-819x1024.jpg", "name": "Corn Balls", "author": "Doobydobap", "difficulty": "Easy", "servingsize": 8, "preptime": "10minutes", "cookingtime": "5minutes", "ingredients": [{"name": "main", "ingredients": ["500 g sweet canned corn OR fresh corn", "½ tbsp kosher salt", "½ cup AP flour", "Parmesan cheese powder", "Parsley"]}, {"name": "Wet Mix", "ingredients": ["1 egg", "100 mL water", "(Use only ¼ cup)"]}], "directions": ["Heat vegetable oil in a large heavy-duty pot to 350F / 180C.", "Prepare the wet mix. Whisk the egg and water together until homogenized. ", "In a large mixing bowl, add the drained sweet canned corn. Add the AP flour and salt to the corn. ", "Mix until all the kernels are well coated. ", "Once all the kernels are coated, drizzle in a little bit of the wet mix. You should be putting in less than ¼ cup of the wet mix— it should only be enough for the mixture to become tacky but not overly doughy. ", "If not using gloves, wash your hands and dust in flour to shape the cornballs. ", "Scoop around ½ cup of the corn mixture and shape it into small spheres. Move the ball from one hand to the other like you would when juggling. ", "The cornball should be packed enough to not fall apart but not too tightly packed where the ball will be too dense and undercooked. ", "Drop the ball gently into the preheated oil. ", "Agitate the ball for an even fry. Fry for around 4 minutes or until golden brown. ", "Drain on a wire rack and season with salt. Garnish with parmesan cheese powder and parsley. Enjoy!"]},
{"id": null, "imageURL": "https://doobydobap.com/wp-content/uploads/2021/08/1-10-819x1024.jpg", "name": "Ramen Fried Rice", "author": "Doobydobap", "difficulty": "Easy", "servingsize": 1, "preptime": "5minutes", "cookingtime": "15minutes", "ingredients": [{"name": "main", "ingredients": ["1 cup ramen of your choice", "200 g (2 cups) cooked day old white rice or instant rice", "1 egg", "1 tbsp butter", "3 tbsp neutral oil", "1 tsp sesaem oil", "½ tsp sesame seeds"]}], "directions": ["Open the cup ramen and set aside the spice packet. ", "Crush the noodles. ", "Heat a pan on medium heat. Add 1 tbsp of neutral oil once the pan comes up to temperature. ", "Add the crushed ramen noodles. Stir continuously and move around the pan to toast evenly and not burn it. ", "After 2 minutes, the crushed noodles should be golden brown and crispy. ", "Set aside in another bowl. Add ⅓ of the spice packet to the crispy noodles while hot. Mix to combine. Reserve 2 tbsp of the crispy noodles for garnish later.", "In a large mixing bowl, add the rice, egg, and rest of the spice packet. Mix well until all the rice granules are covered with the egg. ", "Heat a large non-stick or well-seasoned pan on high. Add the butter in. ", "Once the butter has melted, add the egg and rice mixture to the pan. ", "Spread the rice mixture thinly, leaving holes in between for the steam to escape. ", "Stir the rice and fry until the egg on the rice has cooked. This process will take around 4 minutes. Toss to combine.", "Add the crispy noodles to the fried rice. Toss to combine. ", "Drizzle in the sesame oil and sesame seeds into the cup ramen container. Add the crispy ramen, then add the fried rice. Make sure to pack the rice firmly so that it will hold its shape. Enjoy!!! "]},
{"id": null, "imageURL": "https://doobydobap.com/wp-content/uploads/2021/09/1-1-819x1024.jpg", "name": "Naengmyun", "author": "Doobydobap", "difficulty": "Medium", "servingsize": 3, "preptime": "30minutes", "cookingtime": "1hour ", "ingredients": [{"name": "main", "ingredients": ["700 g beef rump steak", "1.5 L water", "2 tsp salt", "3 packets naengmyun noodles", "3 hard-boiled eggs", "spicy mustard and vinegar to taste"]}, {"name": "**Pickled Radish", "ingredients": ["200 g or 2 cups daikon", "1 tbsp kosher salt", "1 cup sprite", "½ tbsp gochugaru", "¼ cup sugar", "¼ cup white distilled vinegar"]}], "directions": ["Peel the daikon using a vegetable or potato peeler. Daikon skin has a bitter aftertaste, so it’s crucial you peel before cooking with it!", "Shave off the daikon using a vegetable peeler to make thin ribbons. Make sure to rotate the daikon to have evenly shaped sizes. ", "Add the salt to the radish. Mix to combine.", "Brine the radish for 30 minutes. ", "After 30 minutes, rinse the radish under cold water. Squeeze out any excess moisture. ", "Add the rest of the ingredients. Store in an airtight container and pickle for 1 day. ", "In a large pressure cooker, add the beef and water together. ", "Close the cooker and bring to high pressure, then cook at high pressure for 30 minutes. Make sure to depressurize before opening by using the pressure release valve. ", "Skim any visible fat and skum. Season with salt.", "Cool to room temperature and chill overnight. ", "Skim any fat— if using a very lean cut of beef, there should be none at all!", "Sieve any impurities in the broth using a cheesecloth", "Cook the noodles to the package directions.", "Rinse the noodles thoroughly in running cold water until the water runs clear.", "Squeeze any excess moisture from the noodles. Twirl the noodles to a ball shape. ", "Put the drained pickled radish, sliced beef, and hard boiled egg on top. Pour the broth on the side and add vinegar and spicy mustard (yeon gyeoja) to your liking. Enjoy!"]},
{"id": null, "imageURL": "https://doobydobap.com/wp-content/uploads/2021/09/2-2-819x1024.jpg", "name": "Cha Shu Don with Soy Marinated Jammy Eggs", "author": "Doobydobap", "difficulty": "Medium", "servingsize": 4, "preptime": "30minutes", "cookingtime": "2hours ", "ingredients": [{"name": "main", "ingredients": ["1 kg whole uncut pork belly", "4 eggs", "Freshly steamed white rice", "1 leek, julienned"]}, {"name": "Tare Sauce", "ingredients": ["1 ½ cup light soy sauce", "½ cup dark soy sauce", "½ cup dark brown sugar", "½ cup white sugar (you can also use 1 cup light brown sugar instead of half dark brown half white)", "1 cup sake", "1 cup mirin", "1 cup water", "1 leek", "½ onion", "1 ginger, quartered", "6 garlic cloves"]}], "directions": ["Optional, but recommended: char the leeks and onion until blackened and blistered. This process will give the sauce smokiness and immense depth of flavor. ", "Put the charred leeks and onion in a large saucepan. Add the rest of the sauce ingredients.", "Heat on high heat until the sauce comes to a simmer. Drop the heat to a medium-low and simmer for 30 minutes or until the garlic has fully softened and let out its flavor. ", "Strain the sauce. ", "Roll your pork belly into a tight roll", "Using a butcher's twine, tighten the end of the pork roll to keep it taut. Repeat the process until the pork is in a tight roll. If you're unsure about this process, there are many youtube tutorials online. The pork belly needs to be super tight to stay in the rolled shape later when slicing. ", "Sear the pork on all sides. This process helps crisp up the skin and also gives it a nice char.", "After the pork is golden brown, add it to a large pot with the rest of the tare sauce and 1 cup of water. ", "Simmer the pork in the sauce on medium-low. Cook for 90 minutes, rotating every 15 minutes. I opted to put parchment paper with holes to regulate the amount of sauce evaporation. This technique is called cartouche! You can also put the lid on but slightly ajar. Alternatively, you can cook it in the oven at 325F for 2 hours or until the internal temperature reaches 145F. It's okay if the center is slightly pink! We will be blow-torching or pan-searing before serving. ", "After the pork has finished cooking, let it rest in room temperature for 30 minutes. Make sure to reserve enough tare sauce to marinate the eggs in! Then, transfer the pork to a plastic bag with the remaining sauce. ", "Chill overnight in fridge. ", "Once the pork has chilled, it should be firm and easy to cut. Remove the twine, and cut the cha shu into thin slices. ", "Char the pork with blow torch or lightly pan fry with sauce.", "For assembly, drizzle 2-3 tbsp of the tare sauce over freshly steamed white rice. Place a mound of julienned leeks in the center-- this will help stabilize the cha shu. Plate six slices of cha shu on top of the rice. Drizzle more tare sauce on the cha shu. Enjoy! ", "Put the eggs in a medium-sized pot and cover with water until the half-way mark. ", "Heat on high until the water comes to a low simmer. Drop the heat to a low simmer and set a timer for 6 minutes. ", "Take the eggs out of the water and in an ice-bath to stop them from cooking further. ", "Take the eggshells off and add the tare sauce reserved from the pork. Marinate for 3 hours or overnight!"]},
{"id": null, "imageURL": "https://doobydobap.com/wp-content/uploads/2021/09/2-5-887x1024.jpg", "name": "Dalgona Scone", "author": "Doobydobap", "difficulty": "Medium", "servingsize": 6, "preptime": "30minutes", "cookingtime": "30minutes", "ingredients": [{"name": "main", "ingredients": []}, {"name": "Scone", "ingredients": ["230 g AP Flour", "55 g sugar", "2 g salt", "5 g baking powder", "90 g cold unsalted butter", "1 large egg", "50 mL milk"]}, {"name": "Dalgona", "ingredients": ["200 g white sugar", "100 g water", "10 g baking soda"]}], "directions": ["In a large bowl, add flour, sugar, salt, and baking powder together. Mix to combine. ", "Prepare the wet mix. Whisk the egg and milk together. Reserve 1 tbsp to brush the scones before going into the oven. Place in the refrigerator while preparing the butter. ", "Cube the cold butter into small \"pinky-sized\" pieces. If the butter starts to soften at any point, put it in the freezer.", "Add the cold cubed butter into the dry mix. Using a pastry scraper, break apart the butter into pea-sized pieces. ", "Slowly drizzle in the wet mix together until it forms a shaggy dough. Depending on the humidity, you may not need to use all the wet mixture. ", "Put the dough in a plastic bag and flatten it. Place in fridge for at least 1 hour or overnight. You can also freeze this dough whenever you want fresh scones!", "Preheat your oven to 190C /375F. ", "Divide the dough into six equal pieces. ", "This is my tip for beautiful crumbly scones: Tear the dough and layer the pieces on top to form a rough shape. Do not press on the dough too hard; the scones should just bearly hold together. ", "Place the scones on a parchment-lined baking tray. ", "Brush with the reserved egg wash and place it in the oven. Drop the oven temperature to 180C and bake for 20 minutes or until golden brown. ", "Take out the scones once ready and cool until the dalgona is ready. ", "Mix sugar and water in a large pot. The mixture will almost become ten folds the original size, so make sure to have a large pot. ", "Heat the pot on medium. Leave the saucepan and do not agitate it. ", "Let the sugar melt and simmer until it turns into a pale golden color. This should take around 8 minutes. Do not leave the pot unsupervised as it will turn dark very quickly. ", "Add the baking soda into the pot and whisk quickly using a spatula. This process is to break apart the baking soda and aerate the dalgona to have large air bubbles similar to a honeycomb structure. ", "Scoop the dalgona mixture on top of the scones. Let it cool. I like to eat the dalgona scones when they haven't been completely set and has a slight chewiness, but you can also let it cool further for a crisp finish. ", "Scoop excess dalgona and cool in room temperature or in the fridge for 30 minutes. Break it apart using a hammer. You can also find a dalgona coffee recipe here! "]},
{"id": null, "imageURL": "https://doobydobap.com/wp-content/uploads/2021/09/IMG_2773-2-871x1024.jpg", "name": "Jjajang Tteokbokki", "author": "Doobydobap", "difficulty": "Easy", "servingsize": 2, "preptime": "5minutes", "cookingtime": "25minutes", "ingredients": [{"name": "main", "ingredients": ["500 g or 2 cups rice cakes", "3 sheets or 1 cup fish cakes", "⅓ cup black bean paste", "⅓ cup oil", "2 scallions, thinly sliced", "4 garlic cloves, thinly sliced", "2 tbsp light soy sauce", "2 tbsp sugar", "500 mL water or stock", "1 tbsp butter", "Black pepper", "Gochugaru for garnish"]}], "directions": ["Let’s infuse the oil with aromatics. In a medium-sized pan, add oil, garlic, and scallions and heat on medium until the garlic has turned golden brown.", "Sieve the aromatics and reserve the oil.", "Use the same oil and pour it into a non-stick pan. I recommend using a non-stick pan as black bean tends to stick. Add the black bean paste and heat it on medium heat until the paste starts to bubble. Drop the heat to a medium-low.", "Using a rubber or coated spatula(wooden spatulas will stain), break apart the black bean paste and swirl around so that the oil can penetrate through. This process helps cook out some of the astringent flavors in black bean paste and brings out deep nutty and umami notes.", "After 5 minutes, you’ll see the black bean paste slowly separate. Strain the toasted black bean paste in a sieve— the oil should separate immediately, and you can use this oil for future use!", "In a large pan, heat on high. When smoke starts to rise from the pan, turn the heat off and add the soy sauce.", "Let the soy sauce caramelize and slightly burn. Deglaze with water or stock and scrape the bottom of the pan.", "Heat the broth on high heat and add the fish cakes and the rice cakes. Add the toasted black bean paste, sugar, and black pepper. Stir to combine.", "Simmer on medium heat for 5 minutes or until the rice cakes become malleable, and the sauce thickens.", "Finish with butter and plate. Enjoy!"]},
{"id": null, "imageURL": "https://doobydobap.com/wp-content/uploads/2021/09/IMG_3306-814x1024.jpg", "name": "Prawn Toast", "author": "Doobydobap", "cuisine": null, "difficulty": null, "servingsize": 4, "preptime": "5minutes", "cookingtime": "5minutes", "ingredients": [{"name": "main", "ingredients": ["15 fresh or thawed shrimp, peeled and deveined", "4 slices white bread", "1 ½ tbsp potato starch", "1 egg white", "½ tsp kosher salt", "½ tsp sesame oil", "Neutral oil for frying or airfrying"]}, {"name": "Sauce", "ingredients": ["1 tbsp japanese mayo", "2 tsp sambal or sriracha"]}], "directions": ["Mince the shrimp into a paste. I like to keep mine slightly “chunky” for more texture. ", "Add potato starch, egg white, salt and mix in a circular motion. The consistency should become thicker as stirred. ", "Finish with a little sesame oil and mix. ", "Place half of the mixture on 1 piece of toast. Place another on top like a sandwich. Repeat.", "Fry around 162°C/ 325°F for about 1 minute on each side or until golden brown. If using an air fryer/ convection oven, spray the outer sides of the bread with oil and bake at 360F 182°C / 360°F for 10 minutes. ", "Enjoy with sauce! "]},
{"id": null, "imageURL": "https://doobydobap.com/wp-content/uploads/2021/09/steak-rice-1-885x1024.jpg", "name": "Uni Steak Pot Rice", "author": "Doobydobap", "difficulty": "Medium", "servingsize": 4, "preptime": "10minutes", "cookingtime": "30minutes", "ingredients": [{"name": "main", "ingredients": ["2 ½ cups short-grain sushi rice", "300 g steak (I used top sirloin)", "100 g chives, finely sliced", "100 g uni aka sea urchin", "2 tbsp unsalted butter", "1 tbsp neutral oil", "1 tsp kosher salt", "1 salted egg yolk"]}, {"name": "Sauce", "ingredients": ["½ cup soy sauce", "¼ cup mirin", "¼ cup sake", "2 tbsp sugar", "2 tbsp honey"]}], "directions": ["Wash your rice thoroughly. Rub the rice against each other using the palm of your hands. Repeat the process for 7-8 times or until the water coming from the rice is transparent. ", "Soak the rice in water for 30 minutes. This process allows the rice to plump evenly and to have a fool-proof, evenly cooked fluffy rice. ", "Drain the soaked rice. It should be plumper and even in size. ", "Prepare a heavy-duty pot. I used a cocotte pot from staub because it does an excellent job of keeping the steam and pressure inside. Add the water. The soaked rice to water ratio should be 1:1. ", "Heat your pot on high heat with the lid. ", "Once you hear a slight simmering and bubbling from the rice, open the lid slightly to take a sneak peek. ", "If so, drop the heat to the lowest setting and steam the rice for 15 minutes. ", "Turn the heat off and let the residual heat cook the rice for another 5 minutes. ", "Pat the steak dry with a kitchen towel.", "Season the steak liberally with kosher salt. ", "Heat a large skillet on high heat. Drizzle in the oil, and once the pan starts to smoke, gently drop the steak in slightly. Since I'm using sirloin, the fat cap was on the side of the steak, so I decided to render the beef fat first. ", "Press the steak gently in the center to have an evenly crusted surface. ", "Flip once golden brown. Add the butter in and baste any grey spots. Cook the steak on each side for 1 ½ minutes for a medium rare. The steak will be on the rare side, but do not worry, as the residual heat from the rice will cook the steak to a perfect medium rare once mixed. ", "Take the steak out of the pan and let it rest covered. Make sure to reserve the fat and butter from the cooked steak. ", "Add the sauce ingredients to the skillet used to cook the steak. ", "Simmer on medium heat until the alcohol has evaporated for around 5 minutes. ", "Cut the steak into 1cm cubes. ", "Pour in ¼ cup of the sauce on the rice. ", "Layer on the chives, steak, and uni. ", "Finish with grated salted egg yolk. ", "Mix gently and add in more sauce as needed. Enjoy!"]},
{"id": null, "imageURL": "https://doobydobap.com/wp-content/uploads/2021/06/Thumbnail-44.jpg", "name": "Tteokbokki", "author": "Doobydobap", "difficulty": "Easy", "servingsize": 2, "preptime": "5minutes", "cookingtime": "45minutes", "ingredients": [{"name": "main", "ingredients": ["400 g Korean rice cakes", "150 g fish cakes, quartered and cut into approximately the same size as the rice cakes", "1 leek, cut lengthwise, about the same size as the rice cakes", "500 mL of dashi broth (below)"]}, {"name": "Sauce", "ingredients": ["2 tbsp fine gochugaru powder", "2 tbsp regular gochugaru powder", "2 tbsp gochujang", "2 tbsp soy sauce", "2 tbsp sugar", "1 tbsp neutral oil (it gives the tteokbokki a nice glossy finish!)", "¼ tsp MSG", "It’s better if you let the sauce ~get to know each other~ by letting the flavors develop overnight in the fridge but if you can’t that’s fine too! "]}, {"name": "Dashi Broth", "ingredients": ["½ cup of dried anchovies", "1 kombu kelp", "2 cabbage leaves", "½ leek", "600 mL water"]}], "directions": ["Let’s prepare the broth first.", "Clean your anchovies and toast them on medium heat.", "Once the anchovies are slightly golden, pour in the water and kelp. It’s better if the kelp has been in cold water for a day, but it’s okay if you couldn’t 🙂 just put it in now!", "Add the leeks and cabbage leaves.", "Simmer on medium-low heat for 30 minutes.", "Strain the broth- you should be left with around 500mL.", "Pour the broth into a large pot with the rice cakes.", "Put the heat on high and add in your sauce.", "Simmer the rice cakes for 10 minutes or until the sauce has thickened and the rice cakes are soft.", "Drop the fish cakes and the leeks in. Cook for 5 minutes or until the leeks have softened.", "Enjoy!!"]},
{"id": null, "imageURL": "https://doobydobap.com/wp-content/uploads/2021/06/IMG_8169-2-1024x1017.jpg", "name": "Katsu Curry", "author": "Doobydobap", "difficulty": "Medium", "servingsize": 4, "preptime": "15minutes", "cookingtime": "1hour  30minutes", "ingredients": [{"name": "main", "ingredients": []}, {"name": "Curry", "ingredients": ["1 block, japanese curry block (4 pieces)", "½ cup or 1 stick butter (use half for sauteeing and other half at the end)", "3 onions, julienned", "1 apple, grated", "1 tbsp tomato paste", "2 tbsp honey", "2 tbsp bulldog sauce or worcestshire sauce", "1 tbsp dark soy", "1 L unsalted chicken stock or 1 chicken carcass"]}, {"name": "Katsu", "ingredients": ["300 g pork loin, cut into around 1cm thickness", "1 tsp koscher salt", "½ cup AP flour", "1 cup Japanese panko breadcrumbs", "Neutral oil for frying"]}, {"name": "Batter", "ingredients": ["* 1 egg", "* 1tsp koscher salt", "* 2 tbsp AP flour", "* ¼ cup water"]}], "directions": ["Heat a heavy duty pot on medium low. Add ¼ cup of butter into the pot.", "Once the butter has melted, add the onions in.", "Caramelize the onions on low heat. This process will take around 30-40minutes. The onions will take on a dark brown color and will have a jammy consistency.", "Once the onions have caramelized, add the grated apple and tomato paste.", "Cook the tomato paste for 2-3 minutes.", "Transfer the mixture to a separate bowl.", "Turn the heat on high and add the chicken carcass into the same pot. (Skip this process if you are using chicken stock)", "Once the chicken has taken on some color, add 1L of water in.", "Simmer on low heat for 30 minutes. Take the carcass out once finished.", "Add the paste and the curry block. Simmer on low heat for 10 minutes until the sauce has thickened.", "Add soy sauce, honey, and bulldog sauce as well. (The dark soy is mainly there for the color and extra umami!)", "Blend to combine for a smooth curry.", "Finish with ¼ cup butter for a glossy sauce.", "For a curry that’s even better, rest it overnight to let all the spices get to ~mingle~.", "Remove any excess moisture on the pork loin with a paper towel.", "Heat a large skillet with neutral oil. The oil should come around half the height of the pan.", "Heat the oil until it reaches around 180C/ 355F.", "Coat the pork loin in flour. Dust off any excess flour.", "Then coat the dusted pork loin in the batter. Let some of the excess batter drip off.", "Place the battered pork into the panko mixture. Make sure to tightly pack the pork with the panko and there are no dry spots.", "Gently place the breaded pork into the oil, away from your direction.", "Fry until golden brown, or for around 3 minutes and flip.", "Repeat for the other side until the katsu is golden brown.", "Let it rest on a wired baking tray for about 8 minutes. Wait until you cut into the katsu to make sure it’s extra crispy. If you cut too soon, the juices from the pork will be lost and make the crust soggy.", "While you wait for the pork to rest, plate the rice and curry in a bowl.", "Gently place the sliced katsu on top.", "Enjoy with japanese pickles!!!"]},
{"id": null, "imageURL": "https://doobydobap.com/wp-content/uploads/2021/06/thumbnail-21-1024x1024.jpg", "name": "Cabbage Rolls ", "author": "Doobydobap", "difficulty": "Medium", "servingsize": 2, "preptime": "10minutes", "cookingtime": "15minutes", "ingredients": [{"name": "main", "ingredients": ["6 large cabbage leaves", "250 g ground pork or any other protein! (Firm tofu works beautifully too!)", "2 carrots, finely chopped ½ onion, finely chopped", "1 cup cooked rice, cooled", "1 egg", "1 tbsp soy sauce", "1 tbsp oyster sauce", "Salt and pepper to taste"]}, {"name": "Consommé", "ingredients": ["Chicken bones from 1 carcass", "Vegetable peelings", "1 clove of garlic, halved", "8 bay leaves", "10 whole black peppercorns", "Kosher salt to taste", "2 tbsp olive oil", "2 L water"]}], "directions": ["In a heavy duty pot, drizzle olive oil and brown the chicken.", "Take out the browned chicken and add the vegetable peelings. Once the vegetables and caramelized, add the peppercorns, bay leaves, and water.", "Simmer on low heat for 1-2 hour.", "OR just use store bought chicken stock :p", "Combine all the ingredients together. Mix.", "Blanch the cabbage leaves. Cook in boiling water until tender and slightly translucent, for about 3 minutes. ", "Dab any excess moisture from the cabbage leaves.", "Remove the stems- this helps making the rolling process easier.", "Add about 2 tbsp of the filling per cabbage leaves", "Bring the sides together first and roll.. decisively. Like a burrito!", "Heat the skillet on medium high heat. Drizzle neutral oil and place the cabbage rolls SEAMSIDE down.", "Cover the lid and drop the heat to medium low. Cook until the bottom is golden brown, for 5 minutes. If you like juicier cabbage rolls, add ½ cup stock and simmer on low until the cabbages absorb.", "Plate your beautiful rolls and enjoy with nice warm broth."]},
{"id": null, "imageURL": "https://doobydobap.com/wp-content/uploads/2021/07/sesame-noodles-blog-1-1-819x1024.jpg", "name": "Cold Sesame Noodles", "author": "Doobydobap", "difficulty": "Easy", "servingsize": 2, "preptime": "5minutes", "cookingtime": "10minutes", "ingredients": [{"name": "main", "ingredients": ["400 g Noodles of your choice (soba, somen, capellini, even spaghetti works— I used fresh Jingdu noodles)", "200 g Gai Lan (optional)"]}, {"name": "Sauce", "ingredients": ["2 tbsp Tahini", "2 tbsp Peanutbutter", "2 tbsp Light Soy Sauce", "2 tbsp Chinese Black Vinegar (Balsamic works too)", "1 tbsp Brown Sugar (optional)", "1 tsp Garlic, grated / minced", "1 tsp Sesame Oil"]}, {"name": "Garnish", "ingredients": ["1 tbsp Homemade Chili OIl or Laoganma", "Cilantro (optional)", "Scallions (optional)", "Peanuts (optional)", "Black and white sesame seeds (optional), toasted"]}], "directions": ["Boil a pot of water for the noodles.", "While the water is boiling, prepare the sauce by mixing tahini, peanutbutter, soy sauce, vinegar, garlic, brown sugar, and sesame oil. The brown sugar is optional, taste to your liking. It also depends on what peanutbutter brand / vinegar you’re using. The sauce will feel slightly too thick to coat the noodles— that’s okay, because we’re going to be thinning it out with some of the starchy water from cookign the noodles!", "Cook the noodles to the package directions on the back.", "Take the noodles out run under cold water. This stops the noodles from cooking further and retains a springy texture.", "Reserve 1 cup of the cooking liquid.", "If you’re opting to put in cooked vegetables, use the same water. Quickly blanch for 1-2 and cold shock in ice water to prevent it from browning and to keep it green. Squeeze the water out and set aside until assembly.", "Put the drained cold-shocked noodles in a large bowl.", "Add 2 tbsp of the prepared sauce. Thin out the sauce with ¼ cup- ⅓ cup of the cooking liquid. The starch in the noodle water will make the sauce cohesive and will allow the sauce to evenly coat the noodles.", "Plate your noodles. If you want it to look in the shape I plated mine, use large chopstics and twirl in the center until it forms a large yarn-like ball. Gently place the ball of noodles in your bowl and gently slide the chopsticks out!", "Garnish with crushed more sauce on top, crushed peanuts, sesame seeds, cilantro, scallions, and chili oil! Enjoy!!"]},
{"id": null, "imageURL": "https://doobydobap.com/wp-content/uploads/2021/07/IMG_8775-712x1024.jpg", "name": "Homemade Chili Oil ", "author": "Doobydobap", "difficulty": "Easy", "servingsize": 500, "preptime": "15minutes", "cookingtime": "45minutes", "ingredients": [{"name": "main", "ingredients": ["2 Shallots, thinly sliced", "1 Garlic Clove, crushed", "1 Ginger, thinly sliced", "1 Star Anise", "10 Cloves", "1 tbsp Cumin", "2 tbsp Coriander Seeds", "2 tbsp Szechuan Peppercorns", "1 tbsp Black Peppercorns", "1 Cinnamon Stick", "1 tbsp Sesame Seeds", "1 Nutmeg, microplaned", "500 mL Peanut Oil", "½ cup Korean Chili Powder, Goghugaru", "½ cup Chinese Crushed Chili", "2 tbsp Chinese Black Vinegar (Balsamic works too)", "1 tbsp Koscher Salt"]}], "directions": ["Add the shallots, garlic, ginger, star anise, cloves, cumin, coriander seeds, szechuan peppercorns, black peppercorns, cinnamon stick, sesame seeds, nutmeg, and peanut oil in a medium sized pot.", "Heat the pot on medium heat until it reaches 110C / 230F.", "Lower the heat to the lowest setting and infuse the aromatics and spices in the oil for 45 minutes or until the shallots are goldenbrown and crispy.", "In a thick glass bowl / jar, add the chilis, black vinegar, and salt. Mix.", "Place a metal sieve over the chili mixture and gently pour the oil. Make sure to use oven gloves and to not touch the bowl as it will get very hot.", "Cool it down and keep in an airtight container. Keep in fridge and it will last up to 6 months shelf-stable, but I guarantee you you’re going to use it up within a month."]},
{"id": null, "imageURL": "https://doobydobap.com/wp-content/uploads/2021/07/1-1-819x1024.jpg", "name": "Takoyaki", "author": "Doobydobap", "difficulty": "Easy", "servingsize": 16, "preptime": "15minutes", "cookingtime": "15minutes", "ingredients": [{"name": "main", "ingredients": []}, {"name": "Toppings", "ingredients": ["100 g Octopus", "2 tbsp Beni Shoga (pickled ginger)", "2 Scallions, finely chopped", "2 tbsp Tenkasu"]}, {"name": "Batter", "ingredients": ["1 cup AP Flour", "1 ½ cup Dashi Broth", "2 Eggs", "2 tsp Baking Powder", "½ tsp Salt", "1 tsp Soy Sauce"]}, {"name": "Sauce", "ingredients": ["Okonomiyaki sauce or Bulldog Sauce", "Japanese Mayonnaise", "Katsuobushi or Bonito Flakes", "Aonori"]}], "directions": ["In a large bowl, mix the flour and baking powder together. ", "In another bowl, mix the wet ingredients and the salt together. ", "Add the dry ingredients to the wet ingredients. Whisk until there are no dry spots. Do not overmix as we do not want to work the gluten— we want a light airy dough!", "Transfer the batter to an easily pourable container.", "Heat the takoyaki pan on medium heat. Once the pan has come up to temperature, drizzle in 1tbsp of oil. Drop the heat to low. ", "Fill the spheres with the batter. It’s good to overfill the pan and have excess dough on top. If we only fill up to the crevice, it’ll only be enough dough for half the sphere. The biggest mistake people make is underfilling it which makes sad deflated balls.", "Add the octopus, beni shoga, scallions, and tenkasu. ", "Using a metal chopstick or skewers, flip the takoyaki ball by 90 degrees. Repeat for rest.", "Keep flipping 90 degrees until the takoyaki balls are golden brown. This should take between 10-15 minutes depending on what pan you’re using!", "Transfer onto a plate and top with sauce, mayonnaise, katsuobushi, and aonori! Enjoy!! "]},
{"id": null, "imageURL": "https://doobydobap.com/wp-content/uploads/2021/07/photo-819x1024.jpg", "name": "Hong Shao Rou 红烧肉", "author": "Doobydobap", "difficulty": "Easy", "servingsize": 2, "preptime": "10minutes", "cookingtime": "1hour  10minutes", "ingredients": [{"name": "main", "ingredients": ["500 g pork belly, cut into approximately 3cm cubes", "1 tbsp neutral oil", "20 g rock sugar or 2 tbsp sugar", "2 tbsp light soy sauce", "2 tbsp dark soy sauce", "¼ cup Shaoxing wine ", "600 mL water", "3 slices of ginger", "2 star anise pods", "1 tangerine peel (fresh or dry. Any citrus peel will work!)", "Green onions for garnish"]}], "directions": ["Blanch the pork belly. In a pot of boiling water, gently drop the pork belly cubes in. Blanch for 3-4 minutes until the scum rises to the top. This ensures that the impurities won’t be in our final sauce. ", "Rinse your pork chunks for any impurities. Drain and tab excess moisture with a tea towel. ", "Heat a heavy duty pot (like a dutch oven or large cast iron with a lid) on medium high heat. ", "Drizzle in the oil and add the pork. ", "Sear the pork on all sides and add the sugar and soy sauce in. ", "Once the sugar has caramelized and coated the pork, deglaze the pot with Shaoxing wine and water. ", "Add the ginger, citrus peel, and star anise. ", "Cover and lower the heat to low. Simmer for 1 hour until the pork is tender. Supplement with more water if the sauce seems too thick / might burn. Alternatively, you can cook this in an instant pot or pressure cooker with 300mL of water for 20 minutes on high pressure. ", "Serve on top of rice. Drizzle the glaze on the rice first and plate a generous mountain of pork belly! Garnish with scallions and enjoy!!"]},
{"id": null, "imageURL": "https://doobydobap.com/wp-content/uploads/2021/07/IMG_9406-1024x1024.jpg", "name": "Kimchi Cheese Rice Balls", "author": "Doobydobap", "difficulty": "Easy", "servingsize": 4, "preptime": "20minutes", "cookingtime": "40minutes", "ingredients": [{"name": "main", "ingredients": ["2 cups cooked short grain rice (aka sushi rice)", "1 cup kimchi, finely chopped (I like to use a food processor or scissors to finely chop my kimchi as it tends to stain cutting boards)", "1 tsp sesame oil", "1 tsp gochujang", "2 tsp honey", "1 tsp light soy sauce", "1 tsp dark soy sauce (optional, mostly there for the color. Can substitute with light soy sauce)", "½ cup shredded low moisture mozzarella (make sure to thaw it out if frozen)"]}], "directions": ["Preheat your oven to 200C / 400F. For air fryer skip the preheating process.", "Pulse your kimchi in a food processor until a fine chop. ", "Prepare the sauce. Mix gochujang, honey, light soy sauce, and dark soy sauce. This sauce is to season the rice and to give the rice balls a nice red color. ", "In a nonstick pan, drizzle in the sesame oil. Heat the pan on medium heat and add your pulsed kimchi. ", "Cook out the kimchi for 3-4 minutes until most of the moisture has evaporated. It’s important to make sure that the kimchi mixture is not too wet or it will make the rice balls fall apart. ", "Once the kimchi has cooked out, add the prepared sauce. ", "Cook the sauce and the kimchi until the sauce has thickened, for additional 3-4 minutes. ", "Add the fillings to the rice. If the rice is freshly made, make sure to cool it down to room temperature so that some of the moisture has evaporated. Mix. ", "Taste the rice mixture. Depending on the brand of kimchi / your preference, add more salt if needed. ", "Scoop out ⅓ cup of the rice and lay it flat on your hands. I recommend using gloves as it can get a little messy, but if not, slightly wet your hands in water so that the rice does not stick. ", "Add a tablespoon of mozzarella in the center.", "Put additional rice on top to help form the ball. ", "Bring the sides together and roll into a sphere. Then, slowly shape the rice to your desired shape. ", "Place the rice balls on parchment paper on a baking tray. Brush on sesame oil on the top for a golden crispy top. You can also individually wrap them and put in the freezer. These freeze extremely well and can be microwaved for a quick snack. I microwave these for about 3 minutes / air fry them at 400F for 30 minutes from when they’re frozen. ", "For ovens, bake for 20 minutes on each side, for a total of 40 minutes. For an even crispier top, broil it for 30 seconds on each sides so that the rice puffs up like and for the extra crunch.", "For air fryers, bake for 20 minutes at 400F. For an even crispier finish, crank the heat to maximum with an extra brushing of oil. ", "Enjoy! "]},
{"id": null, "imageURL": "https://doobydobap.com/wp-content/uploads/2021/07/12-2-819x1024.jpg", "name": "Yangnyum Gyejang (Spicy Marinated Crabs)", "author": "Doobydobap", "difficulty": "Easy", "servingsize": 2, "preptime": "30minutes", "cookingtime": "3hours ", "ingredients": [{"name": "main", "ingredients": ["2 blue shell crabs (fresh or flash frozen)", "1 cup soju / sake"]}, {"name": "Sauce", "ingredients": ["5 tbsp gochugaru", "2 tbsp soy sauce", "2 tbsp light brown sugar", "2 tbsp honey", "1 tbsp minced garlic", "1 tsp sesame oil", "1 tsp sesame seeds"]}], "directions": ["Prepare the crabs.", "If flash-frozen… Clean and wash the crabs thoroughly using a clean toothbrush. Scrub away at any crevices such as the mouth and the belly of the crabs. Cut off any inedible pieces using scissors. Open up the crab by removing the shell. Remove the gills from the crabs.", "If alive… freeze the crabs for 2 hours to put them to sleep. Same procedure as the flash-frozen crabs.", "Cut the crab into 4 pieces. Place in a large bowl.", "Pour 1 cup soju / sake. This helps rid of any fishiness and gunk that may still be present on the crabs. Let it sit for 20 minutes.", "Prepare the sauce.", "Drain the excess liquid from the crabs. In a clean bowl, add the crabs and the sauce. Mix well.", "Cover with plastic wrap and place in the fridge to marinate for 3 hours.", "Garnish with sesame seeds and an extra drizzle of sesame oil.", "Enjoy with a bowl of hot warm rice!"]},
{"id": null, "imageURL": "https://doobydobap.com/wp-content/uploads/2021/07/IMG_9648-760x1024.jpg", "name": "Naporitan", "author": "Doobydobap", "difficulty": "Easy", "servingsize": 1, "preptime": "10minutes", "cookingtime": "19minutes", "ingredients": [{"name": "main", "ingredients": ["6 Japanese pork sausages", "¼ green bell pepper ", "¼ red bell pepper", "½ onion ", "100 g spaghetti", "1 tbsp butter", "2 tbsp ketchup", "1 tbsp bulldog sauce", "1 tsp soy sauce", "Black pepper", "Parmesan"]}], "directions": ["Prep the vegetables. Cut the onions and the bell peppers into 0.5cm / quarter inch thickness. ", "Slice the sausages diagonally, also 0.5cm / quarter inch thickness", "Cook the spaghetti noodles according to the package instructions to al dente. Make sure to salt your pasta water!", "Drain the spaghetti noodles and spread in a flat plate to make sure some of the water evaporates off. I personall like it when the noodles are slightly toasted— this is a preference! If you want a more coagulated sauce, make sure to reserve ¼ cup pasta water. ", "In a large skillet. Melt the butter on high heat. ", "Once the butter has melted, add the sausages in. ", "Cook the sausages until some of the fat has rendered out and the butter has turned light brown. ", "Add the bellpepper and the onion. Sautée until the onions are translucent, or for about 1-2 minutes.", "Add the sauce to the vegetables. Mix.", "Add the spaghetti noodles in. Mix. ", "Plate on a hot stone or cook on medium heat for another 3 minutes for a slightly crunchy bottom. Garnish with parmesan. Enjoy!"]},
{"id": null, "imageURL": "https://doobydobap.com/wp-content/uploads/2021/07/21-819x1024.jpg", "name": "Spicy Crab-ocado Maki", "author": "Doobydobap", "difficulty": "Easy", "servingsize": 2, "preptime": "15minutes", "cookingtime": "15minutes", "ingredients": [{"name": "main", "ingredients": ["200 g surimi, or real crab meat", "2 tbsp japanese mayonnaise", "1 tsp cayenne pepper", "1 tsp smoked paprika", "1 tbsp chili oil", "½ avocado, thinly sliced", "1 bundle chives", "1 tsp wasabi", "2 nori sheets ", "3 cups cooked sushi rice (2 cups uncooked)", "4 tbsp rice wine vinegar", "2 tsp koscher salt", "1 tbsp sugar"]}], "directions": ["Clean the rice under cold running water and rub the granules against each other. Repeat the process another 7-8 times or until the water is not opaque. ", "Soak the rice in water for 30 minutes. ", "Drain the rice and add kombu dashi stock or water into a clay pot. The ratio should be 1:1 for rice to liquid. ", "Place the kombu on top of the rice. (Optional)", "Cover the lid and heat on high. ", "Gently open the lid to peek if the rice is simmering. When it is, close the lid and drop the heat to the lowest setting. ", "Cook the rice for 10 minutes. ", "Once the rice has absorbed most of the moisture, let it steam off heat in residual heat with the lid on for another 10 minutes. ", "Take the rice out in a large bowl and let some of the excess steam evaporate. ", "Pour the sushi vinegar mix over the rice and gently combine to make sure each granule is evenly coated. ", "Shred the surimi. Add the mayonnaise, cayenne pepper, smoked paprika, and chili oil. Mix. ", "Place a bamboo sushi mat or plastic wrap on a flat surface. ", "Put a sheet of nori. ", "Scoop out 1 cup of sushi rice and form it into a ball. ", "Place the ball in the center of the nori and spread the rice evenly until the ⅔ line. Make sure the nori is completely covered with a thin layer of rice! ", "Place the wasabi, half of the surimi mixture, and chives in the middle of the rice. ", "Using a bamboo sushi mat or plastic wrap, roll the maki decisively. The start of the rice should touch the end of the rice when rolled. Make sure to tuck in the fillings as you roll. If you’re hesitant, it’ll fall apart so be bold and decisive! ", "Make sure to let the maki rest for five minutes at room temperature. If you’re a novice maki roller, plastic wrap the roll and reinforce its shape once more. ", "Cut into 2 cm/ 1 inch thickness. ", "Enjoy!"]},
{"id": null, "imageURL": "https://doobydobap.com/wp-content/uploads/2021/07/IMG_0153-768x1024.jpg", "name": "Cold Soba", "author": "Doobydobap", "difficulty": "easy", "servingsize": 2, "preptime": "30minutes", "cookingtime": "30minutes", "ingredients": [{"name": "main", "ingredients": []}, {"name": "Sauce", "ingredients": ["½  leek ", "½ onion", "1 tsp ginger", "1 cup light soy sauce", "½ cup sugar", "1 cup sake", "1 sheet kombu ", "1 cup water", "½ cup bonito flakes"]}, {"name": "Toppings", "ingredients": ["100 g daikon radish", "2 tsp wasabi", "1 scallion, thinly sliced", "200 g soba"]}], "directions": ["Char the leek and onion until it’s blackened and blistered. Use a blow torch or put under broiler settings on your oven. This process helps give the broth a smoky and deep flavor. ", "Add the leek and onion to a pot. Add ginger, soy sauce, sugar, sake, kombu, and water. Reserve the kombu for later!", "Turn the heat on high and until the mixture starts to bubble. Lower the heat to a simmer and reduce the broth for 20 minutes or until the onions and leeks have turned translucent and let out their flavors. ", "Turn the heat off and add the bonito flakes. Let it steep in the residual heat for 10 minutes. ", "Strain the broth. Cool the mixture down and set it aside in a fridge. ", "Grate the daikon radish. If you don’t have a grater, use a food processor or a blender. Add a little water to help it blend easier. ", "Strain the daikon by squeezing out the liquid with your hands. Form into small balls. ", "Cook the soba noodles according to package directions. PRO TIP: The noodles will boil over if left unattended! Have a jug of cold water ready next to the pot so that when it starts foaming and rising you can add a dash of cold water to bring the water down. ", "Drain the noodles and wash the noodles under cold water. This process prevents the noodles from cooking further and allows them to retain a springy and chewy texture. ", "Pour ½ cup of broth for each person. Add equal parts ice to the broth. ", "Add the grated radish and wasabi to your liking to the broth. Start by putting ½ tbsp of grated radish in the broth first and see!", "Dip your soba noodles into the concentrated broth. Slurp and enjoy 🙂"]},
{"id": null, "imageURL": "https://doobydobap.com/wp-content/uploads/2021/07/pink-matter-2-819x1024.jpg", "name": "Bulgogi Kale Ssambap", "author": "Doobydobap", "difficulty": "Easy", "servingsize": 0, "preptime": "15minutes", "cookingtime": "15minutes", "ingredients": [{"name": "main", "ingredients": []}, {"name": "Fast Bulgogi", "ingredients": ["200 g thinly sliced beef (rib eye preferred, shabu-shabu or Philly cheesesteak style)", "½ onion, thinly sliced"]}, {"name": "Bulgogi Sauce", "ingredients": ["½ cup light soy sauce", "2 tbsp mirin", "2 tbsp light brown sugar", "1 tbsp sesame oil", "¼ cup white onion", "1 clove garlic"]}, {"name": "Ssam", "ingredients": ["1 bundle kale", "1 ½ cups cooked rice"]}, {"name": "Ssam Jang", "ingredients": ["½ tbsp gochujang", "½ tbsp miso", "½ tbsp soy sauce", "½ tbsp honey", "½ tbsp peanut butter", "½ tbsp crushed walnuts", "½ tsp sesame seeds", "1 tsp sesame oil"]}], "directions": ["Blend all the ingredients for the bulgogi sauce. Pour the sauce over the beef and onions and marinate for at least 15 minutes.", "Drizzle 1 tbsp of oil and cook the bulgogi on medium-high heat for 10 minutes.", "Take the bulgogi off the heat and let it rest at room temperature while preparing the rest of the ingredients.", "Blanch the kale in boiling water for 1 minute on each side. This process will make the kale go even greener and easier to roll. Take it out of the water on a wired rack and pat down excess moisture.", "Remove the stems by cutting away the harsh stalky part. Alternatively, you can roll the blanched kale with a rolling pin to smash down the stalks.", "Prepare the ssamjang by mixing all the ingredients.", "Add a spoonful of rice, bulgogi, and ½ tsp of the ssamjang.", "Lay the roll on a piece of cling film and shape it into a round “money bag.” Use the cling film as a guide to tighten the ssam to a rounded shape.", "Brush the ssam with sesame oil and garnish with sesame seeds. ", "Gently open the roll and place it on a parchment-lined bento box. The parchment paper prevents the bento from absorbing excess liquid and also keeps the rolls in place from moving around into a jumbled mess!", "Garnish with pickles. Enjoy!"]},
{"id": null, "imageURL": "https://doobydobap.com/wp-content/uploads/2021/07/33-819x1024.jpg", "name": "Mango Bingsoo", "author": "Doobydobap", "difficulty": "Easy", "servingsize": 3, "preptime": "30minutes", "cookingtime": "10minutes", "ingredients": [{"name": "main", "ingredients": ["3 cups whole milk", "½ cup sweet condensed milk", "½ tsp koscher salt ", "4 cups frozen mango (or fresh!)", "½ cup granulated white sugar", "½ cup water", "3 scoops vanilla icecream "]}], "directions": ["Combine whole milk, sweet condensed milk, and kosher salt in a closed container. Shake to combine. ", "Freeze overnight. Alternatively, you can pour the mixture into an ice mold.", "Add 1 cup of mango, sugar, and water to a small saucepan. ", "Heat on medium heat for 5 minutes or until the mangos have softened and the sugar has dissolved. ", "Blend until smooth. The mixture should be slightly more syrupy and watery because it has to be pourable! It’ll also thicken up as it cools down. ", "Using a fork, scrape along with the frozen milk for a fluffy texture", "Place the cubed mangos on the side of the shaved ice. ", "Scoop vanilla ice cream on top. ", "Pour the mango puree on top.", "Enjoy!"]},
{"id": null, "imageURL": "https://doobydobap.com/wp-content/uploads/2022/01/1-3-819x1024.jpg", "name": "Pecan Banana Bread with Coffee Liquor ", "author": "Doobydobap", "difficulty": "Easy", "servingsize": 1, "preptime": "10minutes", "cookingtime": "50minutes", "ingredients": [{"name": "main", "ingredients": ["3 very ripe bananas", "½ cup melted unsalted butter", "2 tbsp neutral oil", "½ cup granulated sugar", "¼ cup greek yogurt / sour cream / or cream cheese", "2 eggs", "¼ cup coffee liquor", "2 cups AP flour", "1 tsp baking soda", "1 teaspoon kosher salt"]}], "directions": ["Preheat the oven to 350F", "In a large bowl, combine all the wet ingredients together. Whisk until no big lumps remain. (If your banans are not ripe, opt to bake it in the oven at 300F for 30 minutes before using.)", "In another bowl, mix the dry ingredients together. ", "Gently combine the dry mix to the wet mix. Make sure to not overmix. A few dry spots are okay!", "Spray a 9x5inch loaf tin with non-stick spray.", "Pour batter into the loaf. ", "Top with turbinado sugar and crushed pecans. ", "Bake at 350F for 50 minutes. ", "Once out of the oven, let it cool on a wired rack for 30 minutes, or try your best to not dig into it right away. "]},
{"id": null, "imageURL": "https://doobydobap.com/wp-content/uploads/2022/02/IMG_9923-2-768x1024.jpg", "name": "Chili Crisp Shakshuka with Garlicky Yogurt", "author": "Doobydobap", "difficulty": "Easy", "servingsize": 1, "preptime": "10minutes", "cookingtime": "15minutes", "ingredients": [{"name": "main", "ingredients": ["1 onion, diced", "6 garlic cloves, leave 1 for garlic yogurt", "2 tbsp olive oil", "1 can whole or pureed tomato", "2 eggs", "1 pinch salt", "1 pinch pepper", "herbs of choice", "1 tbsp lao gan ma chili crisp"]}, {"name": "Sauce", "ingredients": ["½ cup greek yogurt", "2 tbsp extra virgin olive oil", "1 garlic clove, microplaned or finely chopped", "1 pinch salt", "1 pinch pepper"]}], "directions": ["Preheat oven to 180C or 355F.", "Finely slice garlic and dice onion.", "In a medium large skillet, drizzle in olive oil.", "Add the onion and garlic into the skillet", "Sautee on medium heat until the onion and garlic has caramelized into a golden-brown color.", "Add the canned tomatoes and smash them down with your spatula. Make sure to season.", "After the sauce has rendered into a jammy consistency, transfer to a oven-safe dish.", "Make 2 dimples in the sauce for the egg to be nestled in.", "Season the eggs with salt & pepper.", "Bake at 180C /355F for 15 minutes, or until the egg whites have set. Depending on your dish, this will take anywhere between 10-15 minutes! (Shallower the quicker.)", "Serve with chili crisp oil, garlicky yogurt sauce and herbs for garnish. Enjoy!"]},
{"id": null, "imageURL": "https://doobydobap.com/wp-content/uploads/2021/12/2-1-819x1024.jpg", "name": "Gochujang Pasta with Prawns ", "author": "Doobydobap", "difficulty": "Easy", "servingsize": 2, "preptime": "5minutes", "cookingtime": "15minutes", "ingredients": [{"name": "main", "ingredients": ["3 cups pasta (I used Paccheri n° 125, similar to a bigger Rigatoni)", "2 tbsp gochujang (Korean chili paste)", "6 garlic cloves, sliced", "2 cups peeled and deveined raw shrimp", "1 cup heavy cream", "2 tbsp olive oil", "1 tbsp kosher salt per 1L water for cooking pasta", "½ cup pasta water", "¼ cup grated Parmigiano Reggiano, and more for garnish", "1 tbsp butter", "1 bundle of chives or Italian parsley"]}], "directions": ["Cook the pasta al dente or 1 minute shy of cooking instructions. ", "Reserve ½ cup of pasta water and drain. ", "While the pasta is cooking, in a large pan, sauté the garlic on medium heat with olive oil. ", "Once the garlic has slightly softened, add the gochujang paste. ", "Lower the heat and cook the gochujang out to mellow some of the spice. The oil should turn into a beautiful red hue. ", "Add the cooked pasta and the pasta water. Simmer until the sauce has coagulated and starts sticking onto the pasta. ", "Add the shrimp and stir to combine.", "Turn the heat to low, add parmesan and finish the pasta with butter. This helps the sauce stay glossy. ", "Optionally, finish with chives / Italian parsley / a little more olive oil. Plate. Garnish with more grated parmesan. Enjoy!!!"]},
{"id": null, "imageURL": "https://doobydobap.com/wp-content/uploads/2022/02/4-819x1024.jpg", "name": "Blistered Garlic Olive Long Beans", "author": "Doobydobap", "difficulty": "Easy", "servingsize": 1, "preptime": "5minutes", "cookingtime": "10minutes", "ingredients": [{"name": "main", "ingredients": ["2 cups long beans", "5 large garlic cloves", "½ cup olives, pitted", "½ tsp kosher salt", "¼ tsp MSG", "black pepper", "3 tbsp neutral oil"]}, {"name": "Crispy Fried Egg", "ingredients": ["1 egg", "2 tbsp neutral oil"]}], "directions": ["Prep the long beans. Cut into 5cm/ 2 inch lengths. ", "Pulse the garlic, olive, salt, and msg in a food processor. You can also chop finely.", "Heat a large frying pan on high heat.", "Once the pan starts smoking, drizzle in neutral oil.", "Add the long beans to the pan and sautee quickly.", "After 30 seconds to 1 minute, the long beans should start to lightly blister.", "Then, lower the heat to medium and add in the olive garlic mixture.", "Sautee until the mixture starts to become crispy. Drizzle in additional oil if needed.", "Serve with warm rice and crispy fried egg. Enjoy!", "Heat a frying pan on high heat until smoke starts rising.", "Drizzle in neutral oil and crack the egg gently in the center.", "Tilt the frying pan and baste the egg with the hot oil. Spoon the oil over the egg whites to have a cloud-like crispy texture. Avoid spooning oil over the egg yolk if you want a runny yolk.", "If done correctly, the egg should release from the frying pan easily with a gentle scrape with a metal spatula."]}
]